zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_lcd.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*!****************************************************************************
 *  @file       dl_lcd.h
 *  @brief      Liquid Crystal Display (LCD) Driver Library
 *              LCD 液晶显示驱动库
 *  @defgroup   LCD Liquid Crystal Display (LCD)
 *
 *  @anchor ti_dl_dl_lcd_Overview
 *  # Overview
 *
 *  The LCD Library allows full configuration of the MSPM0 LCD module.
 *  The LCD controller creates the AC segment and common voltage signals to
 *  directly drive LCD displays.
 *
 *  本库提供 MSPM0 LCD 模块的完整配置功能。LCD 控制器产生交流段信号和公共
 *  电压信号，用于直接驱动 LCD 显示屏。支持静态至 8-mux 驱动模式，包含充电
 *  泵、内部参考电压、闪烁控制等功能。
 *
 *  <hr>
 ******************************************************************************
 */
/** @addtogroup LCD
 * @{
 */
#ifndef ti_dl_dl_lcd__include
#define ti_dl_dl_lcd__include

#include <stdbool.h>
#include <stdint.h>

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/dl_common.h>

#ifdef __MSPM0_HAS_LCD__

#ifdef __cplusplus
extern "C" {
#endif

/* clang-format off */

/** @addtogroup DL_LCD_INTERRUPT
 *  @{
 */
/*!
 *  @brief Interrupt raised when there is the start of a new LCD frame
 *  新 LCD 帧开始时触发的中断
 */
#define DL_LCD_INTERRUPT_FRAME_START                    (LCD_IMASK_FRMSTART_SET)

/*!
 *  @brief Interrupt raised when blinking segments are turned off
 *  闪烁段关闭时触发的中断
 */
#define DL_LCD_INTERRUPT_BLINKING_SEGMENTS_OFF            (LCD_IMASK_BLKOFF_SET)

/*!
 *  @brief Interrupt raised when blinking segments are turned on
 *  闪烁段开启时触发的中断
 */
#define DL_LCD_INTERRUPT_BLINKING_SEGMENTS_ON              (LCD_IMASK_BLKON_SET)

/** @}*/

/** @addtogroup DL_LCD_SEGMENT_LINE
 *  LCD 段线/引脚编号，范围 0-63
 *  @{
 */
/*!
 *  @brief LCD Pin 0
 */
#define DL_LCD_SEGMENT_LINE_0                                                (0)
/*!
 *  @brief LCD Pin 1
 */
#define DL_LCD_SEGMENT_LINE_1                                                (1)
/*!
 *  @brief LCD Pin 2
 */
#define DL_LCD_SEGMENT_LINE_2                                                (2)
/*!
 *  @brief LCD Pin 3
 */
#define DL_LCD_SEGMENT_LINE_3                                                (3)
/*!
 *  @brief LCD Pin 4
 */
#define DL_LCD_SEGMENT_LINE_4                                                (4)
/*!
 *  @brief LCD Pin 5
 */
#define DL_LCD_SEGMENT_LINE_5                                                (5)
/*!
 *  @brief LCD Pin 6
 */
#define DL_LCD_SEGMENT_LINE_6                                                (6)
/*!
 *  @brief LCD Pin 7
 */
#define DL_LCD_SEGMENT_LINE_7                                                (7)
/*!
 *  @brief LCD Pin 8
 */
#define DL_LCD_SEGMENT_LINE_8                                                (8)
/*!
 *  @brief LCD Pin 9
 */
#define DL_LCD_SEGMENT_LINE_9                                                (9)
/*!
 *  @brief LCD Pin 10
 */
#define DL_LCD_SEGMENT_LINE_10                                              (10)
/*!
 *  @brief LCD Pin 11
 */
#define DL_LCD_SEGMENT_LINE_11                                              (11)
/*!
 *  @brief LCD Pin 12
 */
#define DL_LCD_SEGMENT_LINE_12                                              (12)
/*!
 *  @brief LCD Pin 13
 */
#define DL_LCD_SEGMENT_LINE_13                                              (13)
/*!
 *  @brief LCD Pin 14
 */
#define DL_LCD_SEGMENT_LINE_14                                              (14)
/*!
 *  @brief LCD Pin 15
 */
#define DL_LCD_SEGMENT_LINE_15                                              (15)
/*!
 *  @brief LCD Pin 16
 */
#define DL_LCD_SEGMENT_LINE_16                                              (16)
/*!
 *  @brief LCD Pin 17
 */
#define DL_LCD_SEGMENT_LINE_17                                              (17)
/*!
 *  @brief LCD Pin 18
 */
#define DL_LCD_SEGMENT_LINE_18                                              (18)
/*!
 *  @brief LCD Pin 19
 */
#define DL_LCD_SEGMENT_LINE_19                                              (19)
/*!
 *  @brief LCD Pin 20
 */
#define DL_LCD_SEGMENT_LINE_20                                              (20)
/*!
 *  @brief LCD Pin 21
 */
#define DL_LCD_SEGMENT_LINE_21                                              (21)
/*!
 *  @brief LCD Pin 22
 */
#define DL_LCD_SEGMENT_LINE_22                                              (22)
/*!
 *  @brief LCD Pin 23
 */
#define DL_LCD_SEGMENT_LINE_23                                              (23)
/*!
 *  @brief LCD Pin 24
 */
#define DL_LCD_SEGMENT_LINE_24                                              (24)
/*!
 *  @brief LCD Pin 25
 */
#define DL_LCD_SEGMENT_LINE_25                                              (25)
/*!
 *  @brief LCD Pin 26
 */
#define DL_LCD_SEGMENT_LINE_26                                              (26)
/*!
 *  @brief LCD Pin 27
 */
#define DL_LCD_SEGMENT_LINE_27                                              (27)
/*!
 *  @brief LCD Pin 28
 */
#define DL_LCD_SEGMENT_LINE_28                                              (28)
/*!
 *  @brief LCD Pin 29
 */
#define DL_LCD_SEGMENT_LINE_29                                              (29)
/*!
 *  @brief LCD Pin 30
 */
#define DL_LCD_SEGMENT_LINE_30                                              (30)
/*!
 *  @brief LCD Pin 31
 */
#define DL_LCD_SEGMENT_LINE_31                                              (31)
/*!
 *  @brief LCD Pin 32
 */
#define DL_LCD_SEGMENT_LINE_32                                              (32)
/*!
 *  @brief LCD Pin 33
 */
#define DL_LCD_SEGMENT_LINE_33                                              (33)
/*!
 *  @brief LCD Pin 34
 */
#define DL_LCD_SEGMENT_LINE_34                                              (34)
/*!
 *  @brief LCD Pin 35
 */
#define DL_LCD_SEGMENT_LINE_35                                              (35)
/*!
 *  @brief LCD Pin 36
 */
#define DL_LCD_SEGMENT_LINE_36                                              (36)
/*!
 *  @brief LCD Pin 37
 */
#define DL_LCD_SEGMENT_LINE_37                                              (37)
/*!
 *  @brief LCD Pin 38
 */
#define DL_LCD_SEGMENT_LINE_38                                              (38)
/*!
 *  @brief LCD Pin 39
 */
#define DL_LCD_SEGMENT_LINE_39                                              (39)
/*!
 *  @brief LCD Pin 40
 */
#define DL_LCD_SEGMENT_LINE_40                                              (40)
/*!
 *  @brief LCD Pin 41
 */
#define DL_LCD_SEGMENT_LINE_41                                              (41)
/*!
 *  @brief LCD Pin 42
 */
#define DL_LCD_SEGMENT_LINE_42                                              (42)
/*!
 *  @brief LCD Pin 43
 */
#define DL_LCD_SEGMENT_LINE_43                                              (43)
/*!
 *  @brief LCD Pin 44
 */
#define DL_LCD_SEGMENT_LINE_44                                              (44)
/*!
 *  @brief LCD Pin 45
 */
#define DL_LCD_SEGMENT_LINE_45                                              (45)
/*!
 *  @brief LCD Pin 46
 */
#define DL_LCD_SEGMENT_LINE_46                                              (46)
/*!
 *  @brief LCD Pin 47
 */
#define DL_LCD_SEGMENT_LINE_47                                              (47)
/*!
 *  @brief LCD Pin 48
 */
#define DL_LCD_SEGMENT_LINE_48                                              (48)
/*!
 *  @brief LCD Pin 49
 */
#define DL_LCD_SEGMENT_LINE_49                                              (49)
/*!
 *  @brief LCD Pin 50
 */
#define DL_LCD_SEGMENT_LINE_50                                              (50)
/*!
 *  @brief LCD Pin 51
 */
#define DL_LCD_SEGMENT_LINE_51                                              (51)
/*!
 *  @brief LCD Pin 52
 */
#define DL_LCD_SEGMENT_LINE_52                                              (52)
/*!
 *  @brief LCD Pin 53
 */
#define DL_LCD_SEGMENT_LINE_53                                              (53)
/*!
 *  @brief LCD Pin 54
 */
#define DL_LCD_SEGMENT_LINE_54                                              (54)
/*!
 *  @brief LCD Pin 55
 */
#define DL_LCD_SEGMENT_LINE_55                                              (55)
/*!
 *  @brief LCD Pin 56
 */
#define DL_LCD_SEGMENT_LINE_56                                              (56)
/*!
 *  @brief LCD Pin 57
 */
#define DL_LCD_SEGMENT_LINE_57                                              (57)
/*!
 *  @brief LCD Pin 58
 */
#define DL_LCD_SEGMENT_LINE_58                                              (58)
/*!
 *  @brief LCD Pin 59
 */
#define DL_LCD_SEGMENT_LINE_59                                              (59)
/*!
 *  @brief LCD Pin 60
 */
#define DL_LCD_SEGMENT_LINE_60                                              (60)
/*!
 *  @brief LCD Pin 61
 */
#define DL_LCD_SEGMENT_LINE_61                                              (61)
/*!
 *  @brief LCD Pin 62
 */
#define DL_LCD_SEGMENT_LINE_62                                              (62)
/*!
 *  @brief LCD Pin 63
 */
#define DL_LCD_SEGMENT_LINE_63                                              (63)
 /** @}*/

