zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_lcd.h
/** @addtogroup DL_LCD_MEMORY_BIT
 *  LCD 内存索引寄存器中的位定义，每个位控制对应段线的开关或公共线的分配
 *  @{
 */
/*!
 *  @brief  Bit 0 inside LCD memory index registers
 *  LCD 内存寄存器位 0：段线模式下控制段开关；公共线模式下控制 COM0 分配
 *
 *  If LCD L[2*index] is selected as (1) segment line: 0b = LCD segment off
 *  1b = LCD segment on (2) common line: 0b = Pin L[2*index] not used as COM0
 *  1b = Pin L[2*index] is used as COM0
 */
#define DL_LCD_MEMORY_BIT_0                                (LCD_LCDM_MBIT0_MASK)

/*!
 *  @brief  Bit 1 inside LCD memory index registers
 *  LCD 内存寄存器位 1：段线模式下控制段开关；公共线模式下控制 COM1 分配
 *
 *  If LCD L[2*index] is selected as (1) segment line: 0b = LCD segment off
 *  1b = LCD segment on (2) common line: 0b = Pin L[2*index] not used as COM1
 *  1b = Pin L[2*index] is used as COM1
 */
#define DL_LCD_MEMORY_BIT_1                                (LCD_LCDM_MBIT1_MASK)

/*!
 *  @brief  Bit 2 inside LCD memory index registers
 *  LCD 内存寄存器位 2：段线模式下控制段开关；公共线模式下控制 COM2 分配
 *
 *  If LCD L[2*index] is selected as (1) segment line: 0b = LCD segment off
 *  1b = LCD segment on (2) common line: 0b = Pin L[2*index] not used as COM2
 *  1b = Pin L[2*index] is used as COM2
 */
#define DL_LCD_MEMORY_BIT_2                                (LCD_LCDM_MBIT2_MASK)

/*!
 *  @brief  Bit 3 inside LCD memory index registers
 *  LCD 内存寄存器位 3：段线模式下控制段开关；公共线模式下控制 COM3 分配
 *
 *  If LCD L[2*index] is selected as (1) segment line: 0b = LCD segment off
 *  1b = LCD segment on (2) common line: 0b = Pin L[2*index] not used as COM3
 *  1b = Pin L[2*index] is used as COM3
 */
#define DL_LCD_MEMORY_BIT_3                                (LCD_LCDM_MBIT3_MASK)

/*!
 *  @brief  Bit 4 inside LCD memory index registers
 *  LCD 内存寄存器位 4：段线模式下控制段开关；公共线模式下控制 COM4 分配
 *
 *  If LCD L[2*index] is selected as (1) segment line: 0b = LCD segment off
 *  1b = LCD segment on (2) common line: 0b = Pin L[2*index] not used as COM4
 *  1b = Pin L[2*index] is used as COM4
 */
#define DL_LCD_MEMORY_BIT_4                                (LCD_LCDM_MBIT4_MASK)

/*!
 *  @brief  Bit 5 inside LCD memory index registers
 *  LCD 内存寄存器位 5：段线模式下控制段开关；公共线模式下控制 COM5 分配
 *
 *  If LCD L[2*index] is selected as (1) segment line: 0b = LCD segment off
 *  1b = LCD segment on (2) common line: 0b = Pin L[2*index] not used as COM5
 *  1b = Pin L[2*index] is used as COM5
 */
#define DL_LCD_MEMORY_BIT_5                                (LCD_LCDM_MBIT5_MASK)

/*!
 *  @brief  Bit 6 inside LCD memory index registers
 *  LCD 内存寄存器位 6：段线模式下控制段开关；公共线模式下控制 COM6 分配
 *
 *  If LCD L[2*index] is selected as (1) segment line: 0b = LCD segment off
 *  1b = LCD segment on (2) common line: 0b = Pin L[2*index] not used as COM6
 *  1b = Pin L[2*index] is used as COM6
 */
#define DL_LCD_MEMORY_BIT_6                                (LCD_LCDM_MBIT6_MASK)

/*!
 *  @brief  Bit 7 inside LCD memory index registers
 *  LCD 内存寄存器位 7：段线模式下控制段开关；公共线模式下控制 COM7 分配
 *
 *  If LCD L[2*index] is selected as (1) segment line: 0b = LCD segment off
 *  1b = LCD segment on (2) common line: 0b = Pin L[2*index] not used as COM7
 *  1b = Pin L[2*index] is used as COM7
 */
#define DL_LCD_MEMORY_BIT_7                                (LCD_LCDM_MBIT7_MASK)

/** @}*/

/** @addtogroup DL_LCD_BLINK_MEMORY_BIT
 *  LCD 闪烁内存索引寄存器中的位定义，用于控制闪烁段的开关状态
 *  @{
 */
/*!
 *  @brief  Bit 0 inside LCD blink memory index registers
 *  LCD 闪烁内存寄存器位 0：控制闪烁状态下的段开关或 COM0 分配
 *
 *  If LCD L[2*index] is selected as (1) segment line: 0b = LCD segment off
 *  1b = LCD segment on (2) common line: 0b = Pin L[2*index] not used as COM0
 *  1b = Pin L[2*index] is used as COM0
 */
#define DL_LCD_BLINK_MEMORY_BIT_0                         (LCD_LCDBM_MBIT0_MASK)

/*!
 *  @brief  Bit 1 inside LCD blink memory index registers
 *  LCD 闪烁内存寄存器位 1：控制闪烁状态下的段开关或 COM1 分配
 *
 *  If LCD L[2*index] is selected as (1) segment line: 0b = LCD segment off
 *  1b = LCD segment on (2) common line: 0b = Pin L[2*index] not used as COM1
 *  1b = Pin L[2*index] is used as COM1
 */
#define DL_LCD_BLINK_MEMORY_BIT_1                         (LCD_LCDBM_MBIT1_MASK)

/*!
 *  @brief  Bit 2 inside LCD blink memory index registers
 *  LCD 闪烁内存寄存器位 2：控制闪烁状态下的段开关或 COM2 分配
 *
 *  If LCD L[2*index] is selected as (1) segment line: 0b = LCD segment off
 *  1b = LCD segment on (2) common line: 0b = Pin L[2*index] not used as COM2
 *  1b = Pin L[2*index] is used as COM2
 */
#define DL_LCD_BLINK_MEMORY_BIT_2                         (LCD_LCDBM_MBIT2_MASK)

/*!
 *  @brief Bit 3 inside LCD blink memory index registers
 *  LCD 闪烁内存寄存器位 3：控制闪烁状态下的段开关或 COM3 分配
 *
 *  If LCD L[2*index] is selected as (1) segment line: 0b = LCD segment off
 *  1b = LCD segment on (2) common line: 0b = Pin L[2*index] not used as COM3
 *  1b = Pin L[2*index] is used as COM3
 */
#define DL_LCD_BLINK_MEMORY_BIT_3                         (LCD_LCDBM_MBIT3_MASK)

/*!
 *  @brief  Bit 4 inside LCD blink memory index registers
 *  LCD 闪烁内存寄存器位 4：控制闪烁状态下的段开关或 COM4 分配
 *
 *  If LCD L[2*index] is selected as (1) segment line: 0b = LCD segment off
 *  1b = LCD segment on (2) common line: 0b = Pin L[2*index] not used as COM4
 *  1b = Pin L[2*index] is used as COM4
 */
#define DL_LCD_BLINK_MEMORY_BIT_4                         (LCD_LCDBM_MBIT4_MASK)

/*!
 *  @brief  Bit 5 inside LCD blink memory index registers
 *  LCD 闪烁内存寄存器位 5：控制闪烁状态下的段开关或 COM5 分配
 *
 *  If LCD L[2*index] is selected as (1) segment line: 0b = LCD segment off
 *  1b = LCD segment on (2) common line: 0b = Pin L[2*index] not used as COM5
 *  1b = Pin L[2*index] is used as COM5
 */
#define DL_LCD_BLINK_MEMORY_BIT_5                         (LCD_LCDBM_MBIT5_MASK)

/*!
 *  @brief  Bit 6 inside LCD blink memory index registers
 *  LCD 闪烁内存寄存器位 6：控制闪烁状态下的段开关或 COM6 分配
 *
 *  If LCD L[2*index] is selected as (1) segment line: 0b = LCD segment off
 *  1b = LCD segment on (2) common line: 0b = Pin L[2*index] not used as COM6
 *  1b = Pin L[2*index] is used as COM6
 */
#define DL_LCD_BLINK_MEMORY_BIT_6                         (LCD_LCDBM_MBIT6_MASK)

/*!
 *  @brief  Bit 7 inside LCD blink memory index registers
 *  LCD 闪烁内存寄存器位 7：控制闪烁状态下的段开关或 COM7 分配
 *
 *  If LCD L[2*index] is selected as (1) segment line: 0b = LCD segment off
 *  1b = LCD segment on (2) common line: 0b = Pin L[2*index] not used as COM7
 *  1b = Pin L[2*index] is used as COM7
 */
#define DL_LCD_BLINK_MEMORY_BIT_7                         (LCD_LCDBM_MBIT7_MASK)

/** @}*/

