zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_lcd.h
/*! @enum DL_LCD_FREQ_DIVIDE
 *  LCD 时钟分频系数，fLCD = fSOURCE / (分频值)
 */
typedef enum {
    /*! Divide fLCD by 1  1 分频 */
    DL_LCD_FREQ_DIVIDE_1 = LCD_LCDCTL0_LCDDIVX_DIV_BY_1,
    /*! Divide fLCD by 2 */
    DL_LCD_FREQ_DIVIDE_2 = LCD_LCDCTL0_LCDDIVX_DIV_BY_2,
    /*! Divide fLCD by 3 */
    DL_LCD_FREQ_DIVIDE_3 = LCD_LCDCTL0_LCDDIVX_DIV_BY_3,
    /*! Divide fLCD by 4 */
    DL_LCD_FREQ_DIVIDE_4 = LCD_LCDCTL0_LCDDIVX_DIV_BY_4,
    /*! Divide fLCD by 5 */
    DL_LCD_FREQ_DIVIDE_5 = LCD_LCDCTL0_LCDDIVX_DIV_BY_5,
    /*! Divide fLCD by 6 */
    DL_LCD_FREQ_DIVIDE_6 = LCD_LCDCTL0_LCDDIVX_DIV_BY_6,
    /*! Divide fLCD by 7 */
    DL_LCD_FREQ_DIVIDE_7 = LCD_LCDCTL0_LCDDIVX_DIV_BY_7,
    /*! Divide fLCD by 8 */
    DL_LCD_FREQ_DIVIDE_8 = LCD_LCDCTL0_LCDDIVX_DIV_BY_8,
    /*! Divide fLCD by 9 */
    DL_LCD_FREQ_DIVIDE_9 = LCD_LCDCTL0_LCDDIVX_DIV_BY_9,
    /*! Divide fLCD by 10 */
    DL_LCD_FREQ_DIVIDE_10 = LCD_LCDCTL0_LCDDIVX_DIV_BY_10,
    /*! Divide fLCD by 11 */
    DL_LCD_FREQ_DIVIDE_11 = LCD_LCDCTL0_LCDDIVX_DIV_BY_11,
    /*! Divide fLCD by 12 */
    DL_LCD_FREQ_DIVIDE_12 = LCD_LCDCTL0_LCDDIVX_DIV_BY_12,
    /*! Divide fLCD by 13 */
    DL_LCD_FREQ_DIVIDE_13 = LCD_LCDCTL0_LCDDIVX_DIV_BY_13,
    /*! Divide fLCD by 14 */
    DL_LCD_FREQ_DIVIDE_14 = LCD_LCDCTL0_LCDDIVX_DIV_BY_14,
    /*! Divide fLCD by 15 */
    DL_LCD_FREQ_DIVIDE_15 = LCD_LCDCTL0_LCDDIVX_DIV_BY_15,
    /*! Divide fLCD by 16 */
    DL_LCD_FREQ_DIVIDE_16 = LCD_LCDCTL0_LCDDIVX_DIV_BY_16,
    /*! Divide fLCD by 17 */
    DL_LCD_FREQ_DIVIDE_17 = LCD_LCDCTL0_LCDDIVX_DIV_BY_17,
    /*! Divide fLCD by 18 */
    DL_LCD_FREQ_DIVIDE_18 = LCD_LCDCTL0_LCDDIVX_DIV_BY_18,
    /*! Divide fLCD by 19 */
    DL_LCD_FREQ_DIVIDE_19 = LCD_LCDCTL0_LCDDIVX_DIV_BY_19,
    /*! Divide fLCD by 20 */
    DL_LCD_FREQ_DIVIDE_20 = LCD_LCDCTL0_LCDDIVX_DIV_BY_20,
    /*! Divide fLCD by 21 */
    DL_LCD_FREQ_DIVIDE_21 = LCD_LCDCTL0_LCDDIVX_DIV_BY_21,
    /*! Divide fLCD by 22 */
    DL_LCD_FREQ_DIVIDE_22 = LCD_LCDCTL0_LCDDIVX_DIV_BY_22,
    /*! Divide fLCD by 23 */
    DL_LCD_FREQ_DIVIDE_23 = LCD_LCDCTL0_LCDDIVX_DIV_BY_23,
    /*! Divide fLCD by 24 */
    DL_LCD_FREQ_DIVIDE_24 = LCD_LCDCTL0_LCDDIVX_DIV_BY_24,
    /*! Divide fLCD by 25 */
    DL_LCD_FREQ_DIVIDE_25 = LCD_LCDCTL0_LCDDIVX_DIV_BY_25,
    /*! Divide fLCD by 26 */
    DL_LCD_FREQ_DIVIDE_26 = LCD_LCDCTL0_LCDDIVX_DIV_BY_26,
    /*! Divide fLCD by 27 */
    DL_LCD_FREQ_DIVIDE_27 = LCD_LCDCTL0_LCDDIVX_DIV_BY_27,
    /*! Divide fLCD by 28 */
    DL_LCD_FREQ_DIVIDE_28 = LCD_LCDCTL0_LCDDIVX_DIV_BY_28,
    /*! Divide fLCD by 29 */
    DL_LCD_FREQ_DIVIDE_29 = LCD_LCDCTL0_LCDDIVX_DIV_BY_29,
    /*! Divide fLCD by 30 */
    DL_LCD_FREQ_DIVIDE_30 = LCD_LCDCTL0_LCDDIVX_DIV_BY_30,
    /*! Divide fLCD by 31 */
    DL_LCD_FREQ_DIVIDE_31 = LCD_LCDCTL0_LCDDIVX_DIV_BY_31,
    /*! Divide fLCD by 32 */
    DL_LCD_FREQ_DIVIDE_32 = LCD_LCDCTL0_LCDDIVX_DIV_BY_32,
} DL_LCD_FREQ_DIVIDE;

/*! @enum DL_LCD_MUX_RATE
 *  LCD 多路复用速率，决定驱动模式（静态/2-mux 至 8-mux）
 */
typedef enum {
    /*! Select LCD Mode: static  静态模式 */
    DL_LCD_MUX_RATE_STATIC = LCD_LCDCTL0_LCDMXX_MX_STATIC,
    /*! Select LCD Mode: 2-mux */
    DL_LCD_MUX_RATE_2 = LCD_LCDCTL0_LCDMXX_MX_2,
    /*! Select LCD Mode: 3-mux */
    DL_LCD_MUX_RATE_3 = LCD_LCDCTL0_LCDMXX_MX_3,
    /*! Select LCD Mode: 4-mux */
    DL_LCD_MUX_RATE_4 = LCD_LCDCTL0_LCDMXX_MX_4,
    /*! Select LCD Mode: 5-mux */
    DL_LCD_MUX_RATE_5 = LCD_LCDCTL0_LCDMXX_MX_5,
    /*! Select LCD Mode: 6-mux */
    DL_LCD_MUX_RATE_6 = LCD_LCDCTL0_LCDMXX_MX_6,
    /*! Select LCD Mode: 7-mux */
    DL_LCD_MUX_RATE_7 = LCD_LCDCTL0_LCDMXX_MX_7,
    /*! Select LCD Mode: 8-mux */
    DL_LCD_MUX_RATE_8 = LCD_LCDCTL0_LCDMXX_MX_8,
} DL_LCD_MUX_RATE;

/*! @enum DL_LCD_WAVEFORM_POWERMODE
 *  LCD 波形功耗模式
 */
typedef enum {
    /*! Select low power LCD waveforms  低功耗波形 */
    DL_LCD_WAVEFORM_POWERMODE_LOWPOWER = LCD_LCDCTL0_LCDLP_LP_LCD,
    /*! Select standard LCD waveforms  标准波形 */
    DL_LCD_WAVEFORM_POWERMODE_STANDARD = LCD_LCDCTL0_LCDLP_STD_LCD,
} DL_LCD_WAVEFORM_POWERMODE;

/*! @enum DL_LCD_BLINKING_DIVIDE
 *  LCD 闪烁频率分频系数
 */
typedef enum {
    /*! Divide LCD blinking frequency by 2 */
    DL_LCD_BLINKING_DIVIDE_BY_2 = LCD_LCDBLKCTL_LCDBLKPREX_DIV_BY_2,
    /*! Divide LCD blinking frequency by 4 */
    DL_LCD_BLINKING_DIVIDE_BY_4 = LCD_LCDBLKCTL_LCDBLKPREX_DIV_BY_4,
    /*! Divide LCD blinking frequency by 8 */
    DL_LCD_BLINKING_DIVIDE_BY_8 = LCD_LCDBLKCTL_LCDBLKPREX_DIV_BY_8,
    /*! Divide LCD blinking frequency by 16 */
    DL_LCD_BLINKING_DIVIDE_BY_16 = LCD_LCDBLKCTL_LCDBLKPREX_DIV_BY_16,
    /*! Divide LCD blinking frequency by 32 */
    DL_LCD_BLINKING_DIVIDE_BY_32 = LCD_LCDBLKCTL_LCDBLKPREX_DIV_BY_32,
    /*! Divide LCD blinking frequency by 64 */
    DL_LCD_BLINKING_DIVIDE_BY_64 = LCD_LCDBLKCTL_LCDBLKPREX_DIV_BY_64,
    /*! Divide LCD blinking frequency by 128 */
    DL_LCD_BLINKING_DIVIDE_BY_128 = LCD_LCDBLKCTL_LCDBLKPREX_DIV_BY_128,
    /*! Divide LCD blinking frequency by 256 */
    DL_LCD_BLINKING_DIVIDE_BY_256 = LCD_LCDBLKCTL_LCDBLKPREX_DIV_BY_256,
} DL_LCD_BLINKING_DIVIDE;

/*! @enum DL_LCD_BLINKING_MODE
 *  LCD 闪烁模式
 */
typedef enum {
    /*! Blinking disabled  禁用闪烁 */
    DL_LCD_BLINKING_MODE_DISABLED = LCD_LCDBLKCTL_LCDBLKMODX_BLINK_DISABLE,
    /*! Blinking of individual segments as enabled in LCDBMx  按 LCDBMx 中使能的段单独闪烁 */
    DL_LCD_BLINKING_MODE_INDIVIDUAL_SEGMENTS =
        LCD_LCDBLKCTL_LCDBLKMODX_BLINK_SELECED,
    /*! Blinking of all segments  所有段同时闪烁 */
    DL_LCD_BLINKING_MODE_ALL_SEGMENTS = LCD_LCDBLKCTL_LCDBLKMODX_BLINK_ALL,
    /*! Switch between display contents stored in LCDMx and LCDMBx  在 LCDMx 和 LCDBMx 显示内容间交替切换 */
    DL_LCD_BLINKING_MODE_TOGGLE = LCD_LCDBLKCTL_LCDBLKMODX_BKINK_TOGGLE,
} DL_LCD_BLINKING_MODE;

/*! @enum DL_LCD_CHARGE_PUMP_FREQUENCY
 *  LCD 充电泵频率选择，基于 32.768 kHz 时钟源分频
 */
typedef enum {
    /*! 32.768 kHz / 1 / 8 = 4.096 kHz  */
    DL_LCD_CHARGE_PUMP_FREQUENCY_4096HZ = LCD_LCDVCTL_LCDCPFSELX_DIV_BY_1_BY_8,
    /*! 32.768 kHz / 2 / 8 = 2.048 kHz  */
    DL_LCD_CHARGE_PUMP_FREQUENCY_2048HZ = LCD_LCDVCTL_LCDCPFSELX_DIV_BY_2_BY_8,
    /*! 32.768 kHz / 3 / 8 = 1.365 kHz  */
    DL_LCD_CHARGE_PUMP_FREQUENCY_1365HZ = LCD_LCDVCTL_LCDCPFSELX_DIV_BY_3_BY_8,
    /*! 32.768 kHz / 4 / 8 = 1.024 kHz  */
    DL_LCD_CHARGE_PUMP_FREQUENCY_1024HZ = LCD_LCDVCTL_LCDCPFSELX_DIV_BY_4_BY_8,
    /*! 32.768 kHz / 5 / 8 = 819 Hz     */
    DL_LCD_CHARGE_PUMP_FREQUENCY_819HZ = LCD_LCDVCTL_LCDCPFSELX_DIV_BY_5_BY_8,
    /*! 32.768 kHz / 6 / 8 = 682 Hz     */
    DL_LCD_CHARGE_PUMP_FREQUENCY_682HZ = LCD_LCDVCTL_LCDCPFSELX_DIV_BY_6_BY_8,
    /*! 32.768 kHz / 7 / 8 = 585 Hz     */
    DL_LCD_CHARGE_PUMP_FREQUENCY_585HZ = LCD_LCDVCTL_LCDCPFSELX_DIV_BY_7_BY_8,
    /*! 32.768 kHz / 8 / 8 = 512 Hz     */
    DL_LCD_CHARGE_PUMP_FREQUENCY_512HZ = LCD_LCDVCTL_LCDCPFSELX_DIV_BY_8_BY_8,
    /*! 32.768 kHz / 9 / 8 = 455 Hz     */
    DL_LCD_CHARGE_PUMP_FREQUENCY_455HZ = LCD_LCDVCTL_LCDCPFSELX_DIV_BY_9_BY_8,
    /*! 32.768 kHz / 10 / 8 = 409 Hz    */
    DL_LCD_CHARGE_PUMP_FREQUENCY_409HZ = LCD_LCDVCTL_LCDCPFSELX_DIV_BY_10_BY_8,
    /*! 32.768 kHz / 11 / 8 = 372 Hz    */
    DL_LCD_CHARGE_PUMP_FREQUENCY_372HZ = LCD_LCDVCTL_LCDCPFSELX_DIV_BY_11_BY_8,
    /*! 32.768 kHz / 12 / 8 = 341 Hz    */
    DL_LCD_CHARGE_PUMP_FREQUENCY_341HZ = LCD_LCDVCTL_LCDCPFSELX_DIV_BY_12_BY_8,
    /*! 32.768 kHz / 13 / 8 = 315 Hz    */
    DL_LCD_CHARGE_PUMP_FREQUENCY_315HZ = LCD_LCDVCTL_LCDCPFSELX_DIV_BY_13_BY_8,
    /*! 32.768 kHz / 14 / 8 = 292 Hz    */
    DL_LCD_CHARGE_PUMP_FREQUENCY_292HZ = LCD_LCDVCTL_LCDCPFSELX_DIV_BY_14_BY_8,
    /*! 32.768 kHz / 15 / 8 = 273 Hz    */
    DL_LCD_CHARGE_PUMP_FREQUENCY_273HZ = LCD_LCDVCTL_LCDCPFSELX_DIV_BY_15_BY_8,
    /*! 32.768 kHz / 16 / 8 = 256 Hz   */
    DL_LCD_CHARGE_PUMP_FREQUENCY_256HZ = LCD_LCDVCTL_LCDCPFSELX_DIV_BY_16_BY_8,
} DL_LCD_CHARGE_PUMP_FREQUENCY;

/*! @enum DL_LCD_VREF_INTERNAL
 *  内部参考电压选择，用于 R13 引脚的电压输出（范围 2.60V ~ 3.50V）
 */
typedef enum {
    /*! 2.60 V internal reference voltage select on R13  */
    DL_LCD_VREF_INTERNAL_2_60V = LCD_LCDVCTL_VLCDX_SEL_2P60V,
    /*! 2.66 V internal reference voltage select on R13  */
    DL_LCD_VREF_INTERNAL_2_66V = LCD_LCDVCTL_VLCDX_SEL_2P66V,
    /*! 2.72 V internal reference voltage select on R13  */
    DL_LCD_VREF_INTERNAL_2_72V = LCD_LCDVCTL_VLCDX_SEL_2P72V,
    /*! 2.78 V internal reference voltage select on R13  */
    DL_LCD_VREF_INTERNAL_2_78V = LCD_LCDVCTL_VLCDX_SEL_2P78V,
    /*! 2.84 V internal reference voltage select on R13  */
    DL_LCD_VREF_INTERNAL_2_84V = LCD_LCDVCTL_VLCDX_SEL_2P84V,
    /*! 2.90 V internal reference voltage select on R13  */
    DL_LCD_VREF_INTERNAL_2_90V = LCD_LCDVCTL_VLCDX_SEL_2P90V,
    /*! 2.96 V internal reference voltage select on R13  */
    DL_LCD_VREF_INTERNAL_2_96V = LCD_LCDVCTL_VLCDX_SEL_2P96V,
    /*! 3.02 V internal reference voltage select on R13  */
    DL_LCD_VREF_INTERNAL_3_02V = LCD_LCDVCTL_VLCDX_SEL_3P02V,
    /*! 3.08 V internal reference voltage select on R13  */
    DL_LCD_VREF_INTERNAL_3_08V = LCD_LCDVCTL_VLCDX_SEL_3P08V,
    /*! 3.14 V internal reference voltage select on R13  */
    DL_LCD_VREF_INTERNAL_3_14V = LCD_LCDVCTL_VLCDX_SEL_3P14V,
    /*! 3.20 V internal reference voltage select on R13  */
    DL_LCD_VREF_INTERNAL_3_20V = LCD_LCDVCTL_VLCDX_SEL_3P20V,
    /*! 3.26 V internal reference voltage select on R13  */
    DL_LCD_VREF_INTERNAL_3_26V = LCD_LCDVCTL_VLCDX_SEL_3P26V,
    /*! 3.32 V internal reference voltage select on R13  */
    DL_LCD_VREF_INTERNAL_3_32V = LCD_LCDVCTL_VLCDX_SEL_3P32V,
    /*! 3.38 V internal reference voltage select on R13  */
    DL_LCD_VREF_INTERNAL_3_38V = LCD_LCDVCTL_VLCDX_SEL_3P38V,
    /*! 3.44 V internal reference voltage select on R13  */
    DL_LCD_VREF_INTERNAL_3_44V = LCD_LCDVCTL_VLCDX_SEL_3P44V,
    /*! 3.50 V internal reference voltage select on R13  */
    DL_LCD_VREF_INTERNAL_3_50V = LCD_LCDVCTL_VLCDX_SEL_3P50V,
} DL_LCD_VREF_INTERNAL;

