zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_lcd.h
/*! @enum DL_LCD_R33_SOURCE
 *  R33 引脚供电来源选择
 */
typedef enum {
    /*! R33 is supplied from charge pump  R33 由充电泵供电 */
    DL_LCD_R33_SOURCE_EXTERNAL = LCD_LCDVCTL_LCDSELVDD_SEL_EXT_SUPPLY,
    /*! R33 is supplied from AVDD internally  R33 由内部 AVDD 供电 */
    DL_LCD_R33_SOURCE_INTERNAL = LCD_LCDVCTL_LCDSELVDD_SEL_AVDD,
} DL_LCD_R33_SOURCE;

/*! @enum DL_LCD_POWER_MODE
 *  LCD 内部偏置电阻梯形网络功耗模式
 */
typedef enum {
    /*! Low power resistor ladder generates bias voltage for the LCD  低功耗模式 */
    DL_LCD_POWER_MODE_LOW = LCD_LCDVCTL_LCD_HP_LP_LP_MODE,
    /*! Higher power resistor ladder generates bias voltage for the LCD  高功耗模式 */
    DL_LCD_POWER_MODE_HIGH = LCD_LCDVCTL_LCD_HP_LP_HP_MODE,
} DL_LCD_POWER_MODE;

/*! @enum DL_LCD_BIAS_VOLTAGE_SOURCE
 *  LCD 偏置电压来源选择
 */
typedef enum {
    /*! Bias voltage sourced from R33 pin  偏置电压来自 R33 引脚 */
    DL_LCD_BIAS_VOLTAGE_SOURCE_R33 = LCD_LCDVCTL_VLCDSEL_VDD_R33_SEL_R33,
    /*! Bias voltage sourced from internal supply voltage AVDD  偏置电压来自内部 AVDD */
    DL_LCD_BIAS_VOLTAGE_SOURCE_AVDD = LCD_LCDVCTL_VLCDSEL_VDD_R33_SEL_AVDD,
} DL_LCD_BIAS_VOLTAGE_SOURCE;

/*! @enum DL_LCD_BIAS
 *  LCD 偏置比选择（仅适用于 5-mux 至 8-mux 模式）
 */
typedef enum {
    /*! For 5-mux to 8-mux modes only. 1/3 bias  1/3 偏置 */
    DL_LCD_BIAS_ONE_THIRD = LCD_LCDVCTL_LCDBIASSEL_ONE_BY_3_BIAS,
    /*! For 5-mux to 8-mux modes only. 1/4 bias  1/4 偏置 */
    DL_LCD_BIAS_ONE_FOURTH = LCD_LCDVCTL_LCDBIASSEL_ONE_BY_4_BIAS,
} DL_LCD_BIAS;

/*! @enum DL_LCD_REFERENCE_MODE
 *  R13 引脚电压参考模式
 */
typedef enum {
    /*! R13 voltage in static mode  静态参考模式 */
    DL_LCD_REFERENCE_MODE_STATIC = LCD_LCDVCTL_LCDREFMODE_STATIC_MODE,
    /*! R13 voltage in switched mode  切换参考模式 */
    DL_LCD_REFERENCE_MODE_SWITCHED = LCD_LCDVCTL_LCDREFMODE_SWITCHED_MODE,
} DL_LCD_REFERENCE_MODE;

/*! @enum DL_LCD_DISP
 *  LCD 显示内容来源选择
 */
typedef enum {
    /*! Display content of LCD memory registers LCDMx  显示 LCD 内存寄存器 LCDMx 的内容 */
    DL_LCD_DISPLAY_REGISTERS_MEMORY = LCD_LCDMEMCTL_LCDDISP_SEL_LCD_MEM_REGS,
    /*! Display content of LCD blinking memory registers LCDBMx  显示闪烁内存寄存器 LCDBMx 的内容 */
    DL_LCD_DISPLAY_REGISTERS_BLINKING_MEMORY =
        LCD_LCDMEMCTL_LCDDISP_SEL_BLNK_MEM_REGS,
} DL_LCD_DISP;

/*! @enum DL_LCD_EVENT_LINE_MODE
 *  LCD 事件/中断线模式
 */
typedef enum {
    /*! The interrupt or event line is disabled.  禁用中断/事件线 */
    DL_LCD_EVENT_LINE_MODE_DISABLED = LCD_EVT_MODE_INT0_CFG_DISABLE,
    /*! The interrupt/event line is in sw mode. Software must clear the RIS.  软件模式，需手动清除 RIS */
    DL_LCD_EVENT_LINE_MODE_SOFTWARE = LCD_EVT_MODE_INT0_CFG_SOFTWARE,
    /*! The interrupt/event line is in hw mode. The hardware clears RIS flag.  硬件模式，硬件自动清除 RIS */
    DL_LCD_EVENT_LINE_MODE_HARDWARE = LCD_EVT_MODE_INT0_CFG_HARDWARE,
} DL_LCD_EVENT_LINE_MODE;

/*! @enum DL_LCD_IIDX
 *  LCD 中断索引，标识最高优先级的待处理中断
 */
typedef enum {
    /*! LCD interrupt index for no interrupt pending  无待处理中断 */
    DL_LCD_IIDX_NO_INT = LCD_IIDX_STAT_NO_INTR,
    /*! LCD interrupt index when start of new frame interrupt  新帧开始中断 */
    DL_LCD_IIDX_FRAME_START = LCD_IIDX_STAT_FRAME_START,
    /*! LCD interrupt index when blinking segments off  闪烁段关闭中断 */
    DL_LCD_IIDX_BLINKING_SEGMENTS_OFF = LCD_IIDX_STAT_BLK_OFF,
    /*! LCD interrupt index when blinking segments on  闪烁段开启中断 */
    DL_LCD_IIDX_BLINKING_SEGMENTS_ON = LCD_IIDX_STAT_BLK_ON,
} DL_LCD_IIDX;

/*! @enum DL_LCD_MEMORY
 *  LCD 内存寄存器索引（LCDMx），共 64 个，每个 32 位
 */
typedef enum {
    /*! Index to access LCD memory register 0 */
    DL_LCD_MEMORY_0 = 0,
    /*! Index to access LCD memory register 1 */
    DL_LCD_MEMORY_1 = 1,
    /*! Index to access LCD memory register 2 */
    DL_LCD_MEMORY_2 = 2,
    /*! Index to access LCD memory register 3 */
    DL_LCD_MEMORY_3 = 3,
    /*! Index to access LCD memory register 4 */
    DL_LCD_MEMORY_4 = 4,
    /*! Index to access LCD memory register 5 */
    DL_LCD_MEMORY_5 = 5,
    /*! Index to access LCD memory register 6 */
    DL_LCD_MEMORY_6 = 6,
    /*! Index to access LCD memory register 7 */
    DL_LCD_MEMORY_7 = 7,
    /*! Index to access LCD memory register 8 */
    DL_LCD_MEMORY_8 = 8,
    /*! Index to access LCD memory register 9 */
    DL_LCD_MEMORY_9 = 9,
    /*! Index to access LCD memory register 10 */
    DL_LCD_MEMORY_10 = 10,
    /*! Index to access LCD memory register 11 */
    DL_LCD_MEMORY_11 = 11,
    /*! Index to access LCD memory register 12 */
    DL_LCD_MEMORY_12 = 12,
    /*! Index to access LCD memory register 13 */
    DL_LCD_MEMORY_13 = 13,
    /*! Index to access LCD memory register 14 */
    DL_LCD_MEMORY_14 = 14,
    /*! Index to access LCD memory register 15 */
    DL_LCD_MEMORY_15 = 15,
    /*! Index to access LCD memory register 16 */
    DL_LCD_MEMORY_16 = 16,
    /*! Index to access LCD memory register 17 */
    DL_LCD_MEMORY_17 = 17,
    /*! Index to access LCD memory register 18 */
    DL_LCD_MEMORY_18 = 18,
    /*! Index to access LCD memory register 19 */
    DL_LCD_MEMORY_19 = 19,
    /*! Index to access LCD memory register 20 */
    DL_LCD_MEMORY_20 = 20,
    /*! Index to access LCD memory register 21 */
    DL_LCD_MEMORY_21 = 21,
    /*! Index to access LCD memory register 22 */
    DL_LCD_MEMORY_22 = 22,
    /*! Index to access LCD memory register 23 */
    DL_LCD_MEMORY_23 = 23,
    /*! Index to access LCD memory register 24 */
    DL_LCD_MEMORY_24 = 24,
    /*! Index to access LCD memory register 25 */
    DL_LCD_MEMORY_25 = 25,
    /*! Index to access LCD memory register 26 */
    DL_LCD_MEMORY_26 = 26,
    /*! Index to access LCD memory register 27 */
    DL_LCD_MEMORY_27 = 27,
    /*! Index to access LCD memory register 28 */
    DL_LCD_MEMORY_28 = 28,
    /*! Index to access LCD memory register 29 */
    DL_LCD_MEMORY_29 = 29,
    /*! Index to access LCD memory register 30 */
    DL_LCD_MEMORY_30 = 30,
    /*! Index to access LCD memory register 31 */
    DL_LCD_MEMORY_31 = 31,
    /*! Index to access LCD memory register 32 */
    DL_LCD_MEMORY_32 = 32,
    /*! Index to access LCD memory register 33 */
    DL_LCD_MEMORY_33 = 33,
    /*! Index to access LCD memory register 34 */
    DL_LCD_MEMORY_34 = 34,
    /*! Index to access LCD memory register 35 */
    DL_LCD_MEMORY_35 = 35,
    /*! Index to access LCD memory register 36 */
    DL_LCD_MEMORY_36 = 36,
    /*! Index to access LCD memory register 37 */
    DL_LCD_MEMORY_37 = 37,
    /*! Index to access LCD memory register 38 */
    DL_LCD_MEMORY_38 = 38,
    /*! Index to access LCD memory register 39 */
    DL_LCD_MEMORY_39 = 39,
    /*! Index to access LCD memory register 40 */
    DL_LCD_MEMORY_40 = 40,
    /*! Index to access LCD memory register 41 */
    DL_LCD_MEMORY_41 = 41,
    /*! Index to access LCD memory register 42 */
    DL_LCD_MEMORY_42 = 42,
    /*! Index to access LCD memory register 43 */
    DL_LCD_MEMORY_43 = 43,
    /*! Index to access LCD memory register 44 */
    DL_LCD_MEMORY_44 = 44,
    /*! Index to access LCD memory register 45 */
    DL_LCD_MEMORY_45 = 45,
    /*! Index to access LCD memory register 46 */
    DL_LCD_MEMORY_46 = 46,
    /*! Index to access LCD memory register 47 */
    DL_LCD_MEMORY_47 = 47,
    /*! Index to access LCD memory register 48 */
    DL_LCD_MEMORY_48 = 48,
    /*! Index to access LCD memory register 49 */
    DL_LCD_MEMORY_49 = 49,
    /*! Index to access LCD memory register 50 */
    DL_LCD_MEMORY_50 = 50,
    /*! Index to access LCD memory register 51 */
    DL_LCD_MEMORY_51 = 51,
    /*! Index to access LCD memory register 52 */
    DL_LCD_MEMORY_52 = 52,
    /*! Index to access LCD memory register 53*/
    DL_LCD_MEMORY_53 = 53,
    /*! Index to access LCD memory register 54 */
    DL_LCD_MEMORY_54 = 54,
    /*! Index to access LCD memory register 55 */
    DL_LCD_MEMORY_55 = 55,
    /*! Index to access LCD memory register 56 */
    DL_LCD_MEMORY_56 = 56,
    /*! Index to access LCD memory register 57 */
    DL_LCD_MEMORY_57 = 57,
    /*! Index to access LCD memory register 58 */
    DL_LCD_MEMORY_58 = 58,
    /*! Index to access LCD memory register 59 */
    DL_LCD_MEMORY_59 = 59,
    /*! Index to access LCD memory register 60 */
    DL_LCD_MEMORY_60 = 60,
    /*! Index to access LCD memory register 61 */
    DL_LCD_MEMORY_61 = 61,
    /*! Index to access LCD memory register 62 */
    DL_LCD_MEMORY_62 = 62,
    /*! Index to access LCD memory register 63 */
    DL_LCD_MEMORY_63 = 63,
} DL_LCD_MEMORY;

/*! @enum DL_LCD_BLINKING_MEMORY
 *  LCD 闪烁内存寄存器索引（LCDBMx），共 32 个
 */
typedef enum {
    /*! Index to access LCD blink memory register 0 */
    DL_LCD_BLINKING_MEMORY_0 = 0,
    /*! Index to access LCD blink memory register 1 */
    DL_LCD_BLINKING_MEMORY_1 = 1,
    /*! Index to access LCD blink memory register 2 */
    DL_LCD_BLINKING_MEMORY_2 = 2,
    /*! Index to access LCD blink memory register 3 */
    DL_LCD_BLINKING_MEMORY_3 = 3,
    /*! Index to access LCD blink memory register 4 */
    DL_LCD_BLINKING_MEMORY_4 = 4,
    /*! Index to access LCD blink memory register 5 */
    DL_LCD_BLINKING_MEMORY_5 = 5,
    /*! Index to access LCD blink memory register 6 */
    DL_LCD_BLINKING_MEMORY_6 = 6,
    /*! Index to access LCD blink memory register 7 */
    DL_LCD_BLINKING_MEMORY_7 = 7,
    /*! Index to access LCD blink memory register 8 */
    DL_LCD_BLINKING_MEMORY_8 = 8,
    /*! Index to access LCD blink memory register 9 */
    DL_LCD_BLINKING_MEMORY_9 = 9,
    /*! Index to access LCD blink memory register 10 */
    DL_LCD_BLINKING_MEMORY_10 = 10,
    /*! Index to access LCD blink memory register 11 */
    DL_LCD_BLINKING_MEMORY_11 = 11,
    /*! Index to access LCD blink memory register 12 */
    DL_LCD_BLINKING_MEMORY_12 = 12,
    /*! Index to access LCD blink memory register 13 */
    DL_LCD_BLINKING_MEMORY_13 = 13,
    /*! Index to access LCD blink memory register 14 */
    DL_LCD_BLINKING_MEMORY_14 = 14,
    /*! Index to access LCD blink memory register 15 */
    DL_LCD_BLINKING_MEMORY_15 = 15,
    /*! Index to access LCD blink memory register 16 */
    DL_LCD_BLINKING_MEMORY_16 = 16,
    /*! Index to access LCD blink memory register 17 */
    DL_LCD_BLINKING_MEMORY_17 = 17,
    /*! Index to access LCD blink memory register 18 */
    DL_LCD_BLINKING_MEMORY_18 = 18,
    /*! Index to access LCD blink memory register 19 */
    DL_LCD_BLINKING_MEMORY_19 = 19,
    /*! Index to access LCD blink memory register 20 */
    DL_LCD_BLINKING_MEMORY_20 = 20,
    /*! Index to access LCD blink memory register 21 */
    DL_LCD_BLINKING_MEMORY_21 = 21,
    /*! Index to access LCD blink memory register 22 */
    DL_LCD_BLINKING_MEMORY_22 = 22,
    /*! Index to access LCD blink memory register 23 */
    DL_LCD_BLINKING_MEMORY_23 = 23,
    /*! Index to access LCD blink memory register 24 */
    DL_LCD_BLINKING_MEMORY_24 = 24,
    /*! Index to access LCD blink memory register 25 */
    DL_LCD_BLINKING_MEMORY_25 = 25,
    /*! Index to access LCD blink memory register 26 */
    DL_LCD_BLINKING_MEMORY_26 = 26,
    /*! Index to access LCD blink memory register 27 */
    DL_LCD_BLINKING_MEMORY_27 = 27,
    /*! Index to access LCD blink memory register 28 */
    DL_LCD_BLINKING_MEMORY_28 = 28,
    /*! Index to access LCD blink memory register 29 */
    DL_LCD_BLINKING_MEMORY_29 = 29,
    /*! Index to access LCD blink memory register 30*/
    DL_LCD_BLINKING_MEMORY_30 = 30,
    /*! Index to access LCD blink memory register 31 */
    DL_LCD_BLINKING_MEMORY_31 = 31,
} DL_LCD_BLINKING_MEMORY;

/*! @enum DL_LCD_COM
 *  LCD 公共线（COM）编号，使用位掩码表示，支持 COM0~COM7
 */
typedef enum {
    /*! Index to access COM 0 */
    DL_LCD_COM_0 = 0x01,
    /*! Index to access COM 1 */
    DL_LCD_COM_1 = 0x02,
    /*! Index to access COM 2 */
    DL_LCD_COM_2 = 0x04,
    /*! Index to access COM 3 */
    DL_LCD_COM_3 = 0x08,
    /*! Index to access COM 4 */
    DL_LCD_COM_4 = 0x10,
    /*! Index to access COM 5 */
    DL_LCD_COM_5 = 0x20,
    /*! Index to access COM 6 */
    DL_LCD_COM_6 = 0x40,
    /*! Index to access COM 7 */
    DL_LCD_COM_7 = 0x80,
} DL_LCD_COM;

/*! @enum DL_LCD_VREFGEN_CYCLES
 *  VREF 生成电路使能时钟周期数
 */
typedef enum {
    /*! Turn on VREF generation circuitry for 16 clock cycles */
    DL_LCD_VREFGEN_CYCLES_16 = LCD_LCDVREFCFG_ONTIME_ONTIME16,
    /*! Turn on VREF generation circuitry for 32 clock cycles */
    DL_LCD_VREFGEN_CYCLES_32 = LCD_LCDVREFCFG_ONTIME_ONTIME32,
    /*! Turn on VREF generation circuitry for 128 clock cycles */
    DL_LCD_VREFGEN_CYCLES_128 = LCD_LCDVREFCFG_ONTIME_ONTIME128,
    /*! Turn on VREF generation circuitry for 256 clock cycles */
    DL_LCD_VREFGEN_CYCLES_256 = LCD_LCDVREFCFG_ONTIME_ONTIME256,
} DL_LCD_VREFGEN_CYCLES;

/**
 * @brief Configuration struct for @ref DL_LCD_init
 * @ref DL_LCD_init 的配置结构体
 */
typedef struct {
    /*! The frequency divider to set. One of @ref DL_LCD_FREQ_DIVIDE
     *  时钟分频系数 */
    DL_LCD_FREQ_DIVIDE frequencyDivider;
    /*! The mux rate. One of @ref DL_LCD_MUX_RATE.
     *  多路复用速率 */
    DL_LCD_MUX_RATE muxRate;
    /*! Select waveforms power mode. One of @ref DL_LCD_WAVEFORM_POWERMODE
     *  波形功耗模式 */
    DL_LCD_WAVEFORM_POWERMODE lowPowerWaveform;
} DL_LCD_Config;

/**
 *  @brief Initialize the LCD peripheral
 *         初始化 LCD 外设
 *
 *  Initializes all the common configurable options for the LCD peripheral. Any
 *  other custom configuration can be done after calling this API. The LCD is
 *  not enabled in this API.
 *
 *  初始化 LCD 外设的通用配置选项。调用此 API 后可进行其他自定义配置。
 *  此 API 不会启用 LCD 模块。
 *
 *  @param[in] lcd      Pointer to the register overlay for the peripheral
 *                      外设寄存器基地址指针
 *  @param[in] config   Configuration for LCD peripheral
 *                      LCD 外设配置参数
 */
void DL_LCD_init(LCD_Regs *lcd, const DL_LCD_Config *config);

/**
 *  @brief Enable a pin as LCD function
 *         将引脚设为 LCD 功能
 *
 *  @param[in] lcd      Pointer to the register overlay for the peripheral
 *                      外设寄存器基地址指针
 *  @param[in] pin      Pin to set as LCD function
 *                      One of @ref DL_LCD_SEGMENT_LINE
 *                      要设置为 LCD 功能的引脚号
 *  @note               This function will disable power to the LCD module.
 *                      If needed, enable the module after by calling
 *                      @ref DL_LCD_enable
 *                      此函数会关闭 LCD 模块电源，如需使用需重新调用 @ref DL_LCD_enable
 */

void DL_LCD_setPinAsLCDFunction(LCD_Regs *lcd, uint32_t pin);

/**
 *  @brief Enable a pin as port function
 *         将引脚恢复为通用端口功能
 *
 *  @param[in] lcd      Pointer to the register overlay for the peripheral
 *                      外设寄存器基地址指针
 *  @param[in] pin      Pin to set as port function.
 *                      One of @ref DL_LCD_SEGMENT_LINE
 *                      要恢复为端口功能的引脚号
 *  @note               This function will disable power to the LCD module.
 *                      If needed, enable the module after by calling
 *                      @ref DL_LCD_enable
 *                      此函数会关闭 LCD 模块电源，如需使用需重新调用 @ref DL_LCD_enable
 */
void DL_LCD_setPinAsPortFunction(LCD_Regs *lcd, uint8_t pin);

/**
 *  @brief Enable an LCD function pin as COM
 *         将 LCD 功能引脚设为公共线（COM）
 *
 *  @param[in] lcd      Pointer to the register overlay for the peripheral
 *                      外设寄存器基地址指针
 *  @param[in] pin      Pin to set as common.
 *                      One of @ref DL_LCD_SEGMENT_LINE
 *                      要设为公共线的引脚号
 *  @param[in] com      The selected COM number for the common line.
 *                      One of @ref DL_LCD_COM
 *                      公共线编号
 */
void DL_LCD_setPinAsCommon(LCD_Regs *lcd, uint8_t pin, uint32_t com);

/**
 *  @brief Enable an LCD function pin as Segment
 *         将 LCD 功能引脚设为段线
 *
 *  @param[in] lcd      Pointer to the register overlay for the peripheral
 *                      外设寄存器基地址指针
 *  @param[in] pin      Pin to set as segment line.
 *                      One of @ref DL_LCD_SEGMENT_LINE
 *                      要设为段线的引脚号
 */
void DL_LCD_setPinAsSegment(LCD_Regs *lcd, uint8_t pin);

/**
 * @brief Enables the Peripheral Write Enable (PWREN) register for the LCD
 *        使能 LCD 外设写使能（PWREN）寄存器
 *
 *  Before any peripheral registers can be configured by software, the
 *  peripheral itself must be enabled by writing the ENABLE bit together with
 *  the appropriate KEY value to the peripheral's PWREN register.
 *
 *  软件配置外设寄存器前，必须先通过写入 KEY 和 ENABLE 位来使能外设。
 *
 *  @note For power savings, please refer to @ref DL_LCD_enable
 *
 *  @param[in] lcd  Pointer to the register overlay for the peripheral
 *                  外设寄存器基地址指针
 *
 */
__STATIC_INLINE void DL_LCD_enablePower(LCD_Regs *lcd)
{
    lcd->PWREN |= (LCD_PWREN_KEY_UNLOCK_W | LCD_PWREN_ENABLE_ENABLE);
}

/**
 * @brief Disables the Peripheral Write Enable (PWREN) register for the LCD
 *        禁用 LCD 外设写使能（PWREN）寄存器
 *
 *  When the PWREN.ENABLE bit is cleared, the peripheral's registers are not
 *  accessible for read/write operations.
 *
 *  清除 PWREN.ENABLE 位后，外设寄存器将不可读写。
 *
 *  @note This API does not provide large power savings. For power savings,
 *  please refer to @ref DL_LCD_enable
 *
 * @param lcd   Pointer to the register overlay for the peripheral
 *              外设寄存器基地址指针
 */
__STATIC_INLINE void DL_LCD_disablePower(LCD_Regs *lcd)
{
    lcd->PWREN = (LCD_PWREN_KEY_UNLOCK_W | LCD_PWREN_ENABLE_DISABLE);
}

/**
 * @brief Returns if the Peripheral Write Enable (PWREN) register for the LCD
 *        is enabled
 *        查询 LCD 外设写使能（PWREN）寄存器是否已使能
 *
 *  Before any peripheral registers can be configured by software, the
 *  peripheral itself must be enabled by writing the ENABLE bit together with
 *  the appropriate KEY value to the peripheral's PWREN register.
 *
 *  When the PWREN.ENABLE bit is cleared, the peripheral's registers are not
 *  accessible for read/write operations.
 *
 *  @param[in]  lcd  Pointer to the register overlay for the peripheral
 *                   外设寄存器基地址指针
 *
 *  @return     If power module on LCD is enabled
 *              LCD 电源模块是否已使能
 *
 * @return true if peripheral register access is enabled
 * @return false if peripheral register access is disabled
 */
__STATIC_INLINE bool DL_LCD_isPowerEnabled(const LCD_Regs *lcd)
{
    return ((lcd->PWREN & LCD_PWREN_ENABLE_MASK) ==
            LCD_PWREN_ENABLE_ENABLE);
}

/**
 *  @brief Resets LCD peripheral
 *         复位 LCD 外设
 *
 *  @param[in] lcd  Pointer to the register overlay for the peripheral
 *                  外设寄存器基地址指针
 *
 */
__STATIC_INLINE void DL_LCD_reset(LCD_Regs *lcd)
{
    lcd->RSTCTL = (LCD_RSTCTL_KEY_UNLOCK_W | LCD_RSTCTL_RESETSTKYCLR_CLR |
            LCD_RSTCTL_RESETASSERT_ASSERT);
}

/**
 *  @brief Checks if LCD peripheral was reset
 *         检查 LCD 外设是否已复位
 *
 *  @param[in]  lcd  Pointer to the register overlay for the peripheral
 *                   外设寄存器基地址指针
 *
 *  @return     If peripheral was reset
 *              外设是否已复位
 *
 *  @retval     true if peripheral was reset since this bit was last cleared by
 *              RESETSTKYCLR in the RSTCTL register
 *  @retval     false if peripheral was not reset since the last bit clear
 */
__STATIC_INLINE bool DL_LCD_isReset(const LCD_Regs *lcd)
{
    return ((lcd->STAT & LCD_STAT_RESETSTKY_MASK) ==
            LCD_STAT_RESETSTKY_RESET);
}

/**
 *  @brief Get the event line mode
 *         获取事件线模式
 *
 *  @param[in]  lcd  Pointer to the register overlay for the peripheral
 *                   外设寄存器基地址指针
 *
 *  @return     event line mode
 *              事件线模式
 *
 *  @retval     One of @ref DL_LCD_EVENT_LINE_MODE
 */
__STATIC_INLINE DL_LCD_EVENT_LINE_MODE DL_LCD_getEventLineMode(const LCD_Regs *lcd)
{
    uint32_t eventLineMode = (lcd->EVT_MODE & LCD_EVT_MODE_INT0_CFG_MASK);

    return (DL_LCD_EVENT_LINE_MODE)(eventLineMode);
}

/**
 *  @brief Gets the highest priority pending interrupt
 *         获取最高优先级的待处理中断
 *
 *  Accesses and reads the IIDX register to obtain the highest currently
 *  pending interrupt. A read clears the corresponding interrupt flag in RIS
 *  and MIS.
 *
 *  读取 IIDX 寄存器获取当前最高优先级待处理中断，读取会清除 RIS 和 MIS 中的对应标志。
 *
 *  @param[in]  lcd  pointer to the register overlay of the peripheral
 *                   外设寄存器基地址指针
 *
 *  @return     The highest priority pending interrupt
 *              最高优先级的待处理中断
 *
 *  @retval     One of @ref DL_LCD_IIDX
 */
__STATIC_INLINE DL_LCD_IIDX DL_LCD_getPendingInterrupt(const LCD_Regs *lcd)
{
    return ((DL_LCD_IIDX) lcd->INT_EVENT0.IIDX);
}

/**
 *  @brief Enable LCD interrupts
 *         使能 LCD 中断
 *
 *  @param[in] lcd              Pointer to the register overlay for the
 *                              peripheral
 *                              外设寄存器基地址指针
 *  @param[in] interruptMask    Bit mask of interrupts to enable. Bitwise OR of
 *                              @ref DL_LCD_INTERRUPT.
 *                              要使能的中断位掩码
 */
__STATIC_INLINE void DL_LCD_enableInterrupt(
    LCD_Regs *lcd, uint32_t interruptMask)
{
    lcd->INT_EVENT0.IMASK |= interruptMask;
}

/**
 *  @brief Disable LCD interrupts
 *         禁用 LCD 中断
 *
 *  @param[in] lcd              Pointer to the register overlay for the
 *                              peripheral
 *                              外设寄存器基地址指针
 *  @param[in] interruptMask    Bit mask of interrupts to disable. Bitwise OR of
 *                              @ref DL_LCD_INTERRUPT.
 *                              要禁用的中断位掩码
 */
__STATIC_INLINE void DL_LCD_disableInterrupt(
    LCD_Regs *lcd, uint32_t interruptMask)
{
    lcd->INT_EVENT0.IMASK &= ~(interruptMask);
}

/**
 *  @brief Check which LCD interrupts are enabled
 *         查询哪些 LCD 中断已使能
 *
 *  @param[in]  lcd             Pointer to the register overlay for the
 *                              peripheral
 *                              外设寄存器基地址指针
 *  @param[in]  interruptMask   Bit mask of interrupts to check. Bitwise OR of
 *                              @ref DL_LCD_INTERRUPT.
 *                              要查询的中断位掩码
 *
 *  @return     Which of the requested LCD interrupts are enabled
 *              已使能的中断标志
 *
 *  @retval     Bitwise OR of @ref DL_LCD_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_LCD_getEnabledInterrupts(
    const LCD_Regs *lcd, uint32_t interruptMask)
{
    return (lcd->INT_EVENT0.IMASK & interruptMask);
}

/**
 *  @brief Check interrupt flag of any LCD interrupt
 *         查询 LCD 中断原始状态（无需事先使能）
 *
 *  Checks if any of the LCD interrupts are pending. Interrupts do not have to
 *  be previously enabled.
 *
 *  @param[in]  lcd             Pointer to the register overlay for the
 *                              peripheral
 *                              外设寄存器基地址指针
 *  @param[in]  interruptMask   Bit mask of interrupts to check. Bitwise OR of
 *                              @ref DL_LCD_INTERRUPT.
 *                              要查询的中断位掩码
 *
 *  @return     Which of the requested LCD interrupts are pending
 *              待处理的中断标志
 *
 *  @retval     Bitwise OR of @ref DL_LCD_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_LCD_getRawInterruptStatus(
    const LCD_Regs *lcd, uint32_t interruptMask)
{
    return (lcd->INT_EVENT0.RIS & interruptMask);
}

/**
 *  @brief Check interrupt flag of enabled LCD interrupts
 *         查询已使能的 LCD 中断的挂起状态
 *
 *  Checks if any of the LCD interrupts that were previously enabled are
 *  pending.
 *
 *  @param[in]  lcd             Pointer to the register overlay for the
 *                              peripheral
 *                              外设寄存器基地址指针
 *  @param[in]  interruptMask   Bit mask of interrupts to check. Bitwise OR of
 *                              @ref DL_LCD_INTERRUPT.
 *                              要查询的中断位掩码
 *
 *  @return     Which of the requested LCD interrupts are pending
 *              已使能且挂起的中断标志
 *
 *  @retval     Bitwise OR of @ref DL_LCD_INTERRUPT values
 *
 *  @sa         DL_LCD_enableInterrupt
 */
__STATIC_INLINE uint32_t DL_LCD_getEnabledInterruptStatus(
    const LCD_Regs *lcd, uint32_t interruptMask)
{
    return (lcd->INT_EVENT0.MIS & interruptMask);
}

