zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_lcd.h
/**
 *  @brief Set LCD interrupts
 *         软件触发 LCD 中断
 *
 *  @param[in] lcd              Pointer to the register overlay for the
 *                              peripheral
 *                              外设寄存器基地址指针
 *  @param[in] interruptMask    Bit mask of interrupts to set. Bitwise OR of
 *                              @ref DL_LCD_INTERRUPT.
 *                              要触发的中断位掩码
 */
__STATIC_INLINE void DL_LCD_setInterrupts(
    LCD_Regs *lcd, uint32_t interruptMask)
{
    lcd->INT_EVENT0.ISET = interruptMask;
}

/**
 *  @brief Clear pending LCD interrupts
 *         清除待处理的 LCD 中断标志
 *
 *  @param[in] lcd              Pointer to the register overlay for the
 *                              peripheral
 *                              外设寄存器基地址指针
 *  @param[in] interruptMask    Bit mask of interrupts to clear. Bitwise OR of
 *                              @ref DL_LCD_INTERRUPT.
 *                              要清除的中断位掩码
 */
__STATIC_INLINE void DL_LCD_clearInterruptStatus(
    LCD_Regs *lcd, uint32_t interruptMask)
{
    lcd->INT_EVENT0.ICLR = interruptMask;
}

/**
 *  @brief Enable external synchronization
 *         使能外部同步
 *
 *  @param[in] lcd  Pointer to the register overlay for the peripheral
 *                  外设寄存器基地址指针
 */
__STATIC_INLINE void DL_LCD_enableExternalSync(LCD_Regs *lcd)
{
    lcd->LCDCTL0 |= LCD_LCDCTL0_LCDSYNCEXT_LCD_EXT_SYNC_ON;
}

/**
 *  @brief Disable external synchronization
 *         禁用外部同步
 *
 *  @param[in] lcd  Pointer to the register overlay for the peripheral
 *                  外设寄存器基地址指针
 */
__STATIC_INLINE void DL_LCD_disableExternalSync(LCD_Regs *lcd)
{
    lcd->LCDCTL0 &= ~(LCD_LCDCTL0_LCDSYNCEXT_MASK);
}

/**
 *  @brief Checks if external synchronization is enabled
 *         查询外部同步是否已使能
 *
 *  @param[in]  lcd  Pointer to the register overlay for the peripheral
 *                   外设寄存器基地址指针
 *
 *  @return     If external synchronization is enabled
 *              外部同步是否已使能
 *
 *  @retval     true if external synchronization enabled
 *  @retval     false if external synchronization is disabled
 */
__STATIC_INLINE bool DL_LCD_isExternalSyncEnabled(const LCD_Regs *lcd)
{
    return ((lcd->LCDCTL0 & LCD_LCDCTL0_LCDSYNCEXT_MASK) ==
            LCD_LCDCTL0_LCDSYNCEXT_LCD_EXT_SYNC_ON);
}

/**
 *  @brief Set the LCD frequency divider.
 *         设置 LCD 时钟分频系数
 *
 *  fLCD = fSOURCE / ((LCDDIVx + 1) × Value[LCDMXx])
 *
 *  @param[in]  lcd     Pointer to the register overlay for the peripheral
 *                      外设寄存器基地址指针
 *  @param[in]  fDiv    The frequency divider to set.
 *                      One of @ref DL_LCD_FREQ_DIVIDE
 *                      时钟分频系数
 *
 *  @pre        The LCD module must be off (LCDCTL0.LCDON == 0) before setting
 *              this configuration.
 *              设置前 LCD 模块必须处于关闭状态
 */
__STATIC_INLINE void DL_LCD_setFreqDiv(
    LCD_Regs *lcd, DL_LCD_FREQ_DIVIDE fDiv)
{
    DL_Common_updateReg(
        &lcd->LCDCTL0, (uint32_t) fDiv, LCD_LCDCTL0_LCDDIVX_MASK);
}

/**
 *  @brief Get the LCD frequency divider
 *         获取当前 LCD 时钟分频系数
 *
 *  @param[in]  lcd     Pointer to the register overlay for the peripheral
 *                      外设寄存器基地址指针
 *
 *  @return     The current frequency divider
 *              当前时钟分频系数
 *
 *  @retval     One of @ref DL_LCD_FREQ_DIVIDE
 */
__STATIC_INLINE DL_LCD_FREQ_DIVIDE DL_LCD_getFreqDiv(const LCD_Regs *lcd)
{
    uint32_t fDiv = (lcd->LCDCTL0 & LCD_LCDCTL0_LCDDIVX_MASK);

    return (DL_LCD_FREQ_DIVIDE)(fDiv);
}

/**
 *  @brief Set the LCD mux rate
 *         设置 LCD 多路复用速率
 *
 *  @param[in]  lcd        Pointer to the register overlay for the peripheral
 *                          外设寄存器基地址指针
 *  @param[in]  muxRate    The mux rate to set. One of @ref DL_LCD_MUX_RATE
 *                          多路复用速率
 *
 *
 *  @pre        The LCD module must be off (LCDCTL0.LCDON == 0) before setting
 *              this configuration. The LCD module can be disabled by calling
 *              DL_LCD_disableModule.
 *              设置前 LCD 模块必须处于关闭状态
 *
 */
__STATIC_INLINE void DL_LCD_setMuxRate(
    LCD_Regs *lcd, DL_LCD_MUX_RATE muxRate)
{
    DL_Common_updateReg(
        &lcd->LCDCTL0, (uint32_t) muxRate, LCD_LCDCTL0_LCDMXX_MASK);
}

/**
 *  @brief Get the LCD mux rate
 *         获取当前 LCD 多路复用速率
 *
 *  @param[in]  lcd     Pointer to the register overlay for the peripheral
 *                      外设寄存器基地址指针
 *
 *  @return     The mux rate
 *              当前多路复用速率
 *
 *  @retval     One of @ref DL_LCD_MUX_RATE
 */
__STATIC_INLINE DL_LCD_MUX_RATE DL_LCD_getMuxRate(const LCD_Regs *lcd)
{
    uint32_t muxRate = (lcd->LCDCTL0 & LCD_LCDCTL0_LCDMXX_MASK);

    return (DL_LCD_MUX_RATE)(muxRate);
}

/**
 * @brief Turns LCD segments on
 *        开启 LCD 段显示
 *
 * @param lcd   Pointer to the register overlay for the peripheral
 *              外设寄存器基地址指针
 */
__STATIC_INLINE void DL_LCD_turnSegmentsOn(LCD_Regs *lcd)
{
    lcd->LCDCTL0 |= LCD_LCDCTL0_LCDSON_LCD_SEG_ON;
}

/**
 * @brief Turns LCD segments off
 *        关闭 LCD 段显示
 *
 * Can be used to flash LCD applications by turning off segment lines
 * and leaving LCD timing generator and R33 enabled.
 *
 * 可用于 LCD 闪烁应用：关闭段线，同时保持时序发生器和 R33 使能。
 *
 * @param lcd   Pointer to the register overlay for the peripheral
 *              外设寄存器基地址指针
 */
__STATIC_INLINE void DL_LCD_turnSegmentsOff(LCD_Regs *lcd)
{
    lcd->LCDCTL0 &= ~(LCD_LCDCTL0_LCDSON_MASK);
}

/**
 *  @brief Set the waveform power mode
 *         设置 LCD 波形功耗模式
 *
 *  @param[in]  lcd                 Pointer to the register overlay for the
 *                                  peripheral
 *                                  外设寄存器基地址指针
 *  @param[in]  waveformPowerMode   The power mode for LCD waveforms.
 *                                  One of @ref DL_LCD_WAVEFORM_POWERMODE
 *                                  波形功耗模式
 *
 *  @pre        The LCD module must be in 1/3 bias mode (LCDBIASSEL == 0)
 *              before setting this configuration.
 *              设置前 LCD 必须处于 1/3 偏置模式
 */
__STATIC_INLINE void DL_LCD_setWaveformPowerMode(
    LCD_Regs *lcd, DL_LCD_WAVEFORM_POWERMODE waveformPowerMode)
{
    DL_Common_updateReg(
        &lcd->LCDCTL0, (uint32_t) waveformPowerMode, LCD_LCDCTL0_LCDLP_MASK);
}

/**
 *  @brief Get the waveform power mode
 *         获取当前 LCD 波形功耗模式
 *
 *  @param[in]  lcd Pointer to the register overlay for the peripheral
 *                  外设寄存器基地址指针
 *
 *  @return     The waveform power mode
 *              当前波形功耗模式
 *
 *  @retval     One of @ref DL_LCD_WAVEFORM_POWERMODE
 */
__STATIC_INLINE DL_LCD_WAVEFORM_POWERMODE DL_LCD_getWaveformPowerMode(
    const LCD_Regs *lcd)
{
    uint32_t waveformPowerMode = (lcd->LCDCTL0 & LCD_LCDCTL0_LCDLP_MASK);

    return (DL_LCD_WAVEFORM_POWERMODE)(waveformPowerMode);
}

/**
 * @brief Enables the LCD module
 *        使能 LCD 模块
 *
 * @param lcd   Pointer to the register overlay for the peripheral
 *              外设寄存器基地址指针
 */
__STATIC_INLINE void DL_LCD_enable(LCD_Regs *lcd)
{
    lcd->LCDCTL0 |= LCD_LCDCTL0_LCDON_LCD_MOD_ENABLE;
}

/**
 * @brief Disables the LCD module
 *        禁用 LCD 模块
 *
 * @param lcd   Pointer to the register overlay for the peripheral
 *              外设寄存器基地址指针
 */
__STATIC_INLINE void DL_LCD_disable(LCD_Regs *lcd)
{
    lcd->LCDCTL0 &= ~(LCD_LCDCTL0_LCDON_MASK);
}

/**
 *  @brief Set the blinking frequency divider and blinking mode
 *         设置闪烁频率分频系数和闪烁模式
 *
 *  @param[in] lcd          Pointer to the register overlay for the peripheral
 *                          外设寄存器基地址指针
 *  @param[in] blinkFreqDiv The blinking frequency divider to set.
 *                          One of @ref DL_LCD_BLINKING_DIVIDE
 *                          闪烁频率分频系数
 *  @param[in] blinkMode    The blinking mode to select.
 *                          One of @ref DL_LCD_BLINKING_MODE
 *                          闪烁模式
 */
__STATIC_INLINE void DL_LCD_setBlinkingControl(
    LCD_Regs *lcd, DL_LCD_BLINKING_DIVIDE blinkFreqDiv,
    DL_LCD_BLINKING_MODE blinkMode)
{
    DL_Common_updateReg(&lcd->LCDBLKCTL, (uint32_t) blinkFreqDiv |
        (uint32_t) blinkMode, LCD_LCDBLKCTL_LCDBLKPREX_MASK |
        LCD_LCDBLKCTL_LCDBLKMODX_MASK);
}

/**
 *  @brief Get the blinking frequency divider
 *         获取当前闪烁频率分频系数
 *
 *  @param[in]  lcd Pointer to the register overlay for the peripheral
 *                  外设寄存器基地址指针
 *
 *  @return     The current blinking frequency divider
 *              当前闪烁频率分频系数
 *
 *  @retval     One of @ref DL_LCD_BLINKING_DIVIDE
 */
__STATIC_INLINE DL_LCD_BLINKING_DIVIDE DL_LCD_getBlinkingFreqDiv(const LCD_Regs *lcd)
{
    uint32_t blinkFreqDiv = (lcd->LCDBLKCTL & LCD_LCDBLKCTL_LCDBLKPREX_MASK);

