zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_lcd.h
    return (DL_LCD_BLINKING_DIVIDE)(blinkFreqDiv);
}

/**
 *  @brief Get the blinking mode
 *         获取当前闪烁模式
 *
 *  @param[in]  lcd Pointer to the register overlay for the peripheral
 *                  外设寄存器基地址指针
 *
 *  @return     The current blinking mode
 *              当前闪烁模式
 *
 *  @retval     One of @ref DL_LCD_BLINKING_MODE
 */
__STATIC_INLINE DL_LCD_BLINKING_MODE DL_LCD_getBlinkingMode(const LCD_Regs *lcd)
{
    uint32_t blinkMode = (lcd->LCDBLKCTL & LCD_LCDBLKCTL_LCDBLKMODX_MASK);

    return (DL_LCD_BLINKING_MODE)(blinkMode);
}

/**
 *  @brief Clear LCD blinking memory
 *         清除所有 LCD 闪烁内存寄存器
 *
 *  Clears all blinking memory registers LCDBMx.
 *  The bit is automatically reset when blinking memory cleared.
 *
 *  清除所有 LCDBMx 闪烁内存寄存器，清除完成后该位自动复位。
 *
 *  @param lcd   Pointer to the register overlay for the peripheral
 *              外设寄存器基地址指针
 */
__STATIC_INLINE void DL_LCD_clearAllBlinkingMemoryRegs(LCD_Regs *lcd)
{
    DL_Common_updateReg(&lcd->LCDMEMCTL,
        LCD_LCDMEMCTL_LCDCLRBM_CLR_BLNK_MEM_REGS, LCD_LCDMEMCTL_LCDCLRBM_MASK);
}

/**
 *  @brief Clear LCD memory
 *         清除所有 LCD 内存寄存器
 *
 *  Clears all memory registers LCDMx.
 *  The bit is automatically reset when LCD memory cleared.
 *
 *  清除所有 LCDMx 内存寄存器，清除完成后该位自动复位。
 *
 *  @param lcd   Pointer to the register overlay for the peripheral
 *              外设寄存器基地址指针
 */
__STATIC_INLINE void DL_LCD_clearAllMemoryRegs(LCD_Regs *lcd)
{
    DL_Common_updateReg(&lcd->LCDMEMCTL, LCD_LCDMEMCTL_LCDCLRM_CLR_LCD_MEM_REGS,
        LCD_LCDMEMCTL_LCDCLRM_MASK);
}

/**
 *  @brief Select LCD memory registers for display
 *         选择用于显示的 LCD 内存寄存器
 *
 *  @param[in]  lcd     Pointer to the register overlay for the peripheral
 *                      外设寄存器基地址指针
 *  @param[in]  dispSel The memory registers to select. One of @ref DL_LCD_DISP
 *                      显示内容来源
 *
 *  @pre        LCDDISP can only be set by software when LCDBLKMODx is disabled.
 *              Bit cleared/cannot be changed by software when
 *              LCDBLKMODx == DL_LCD_BLINKING_MODE_INDIVIDUAL_SEGMENTS,
 *              DL_LCD_BLINKING_MODE_ALL_SEGMENTS or if a mux mode = 5 selected.
 *              仅当 LCDBLKMODx 禁用时可由软件设置
 */
__STATIC_INLINE void DL_LCD_selectMemRegsForDisplay(
    LCD_Regs *lcd, DL_LCD_DISP dispSel)
{
    DL_Common_updateReg(&lcd->LCDMEMCTL, (uint32_t) dispSel,
        LCD_LCDMEMCTL_LCDDISP_MASK);
}

/**
 *  @brief Get the LCD memory registers selected for display
 *         获取当前用于显示的 LCD 内存寄存器选择
 *
 *  When LCDBLKMODx = DL_LCD_BLINKING_MODE_TOGGLE, this bit reflects the
 *  currently displayed memory but cannot be changed by software.
 *  When returning to LCDBLKMODx is disabled, bit is cleared.
 *
 *  当闪烁模式为 TOGGLE 时，此位反映当前显示的内存但不可由软件修改。
 *
 *  @param[in]  lcd Pointer to the register overlay for the peripheral
 *                  外设寄存器基地址指针
 *
 *  @return     LCD memory registers selected for display
 *              当前显示的内存寄存器选择
 *
 *  @retval     One of @ref DL_LCD_DISP
 */
__STATIC_INLINE DL_LCD_DISP DL_LCD_getSelectedMemRegsForDisplay(const LCD_Regs *lcd)
{
    uint32_t dispSel = (lcd->LCDMEMCTL & LCD_LCDMEMCTL_LCDDISP_MASK);

    return (DL_LCD_DISP)(dispSel);
}

/**
 * @brief Enables VBOOST on LCD module
 *        使能 LCD 模块的 VBOOST 升压功能
 *
 * @param lcd   Pointer to the register overlay for the peripheral
 *              外设寄存器基地址指针
 */
__STATIC_INLINE void DL_LCD_enableVBOOST(LCD_Regs *lcd)
{
    lcd->LCDVCTL |= LCD_LCDVCTL_LCDVBSTEN_ENABLE;
}

/**
 * @brief Disables VBOOST on LCD module
 *        禁用 LCD 模块的 VBOOST 升压功能
 *
 * @param lcd   Pointer to the register overlay for the peripheral
 *              外设寄存器基地址指针
 */
__STATIC_INLINE void DL_LCD_disableVBOOST(LCD_Regs *lcd)
{
    lcd->LCDVCTL &= ~(LCD_LCDVCTL_LCDVBSTEN_MASK);
}

/**
 *  @brief Set charge pump frequency
 *         设置充电泵频率
 *
 *  @param[in] lcd              Pointer to the register overlay for the
 *                              peripheral
 *                              外设寄存器基地址指针
 *  @param[in] chargePumpFreq   The charge pump frequency to select.
 *                              One of @ref DL_LCD_CHARGE_PUMP_FREQUENCY
 *                              充电泵频率
 *
 */
__STATIC_INLINE void DL_LCD_setChargePumpFreq(
    LCD_Regs *lcd, DL_LCD_CHARGE_PUMP_FREQUENCY chargePumpFreq)
{
    DL_Common_updateReg(&lcd->LCDVCTL, (uint32_t) chargePumpFreq,
        LCD_LCDVCTL_LCDCPFSELX_MASK);
}

/**
 *  @brief Get the charge pump frequency
 *         获取当前充电泵频率
 *
 *  @param[in]  lcd Pointer to the register overlay for the peripheral
 *                  外设寄存器基地址指针
 *
 *  @return     The current charge pump frequency
 *              当前充电泵频率
 *
 *  @retval     One of @ref DL_LCD_CHARGE_PUMP_FREQUENCY
 */
__STATIC_INLINE DL_LCD_CHARGE_PUMP_FREQUENCY DL_LCD_getChargePumpFreq(
    const LCD_Regs *lcd)
{
    uint32_t chargePumpFreq = (lcd->LCDVCTL & LCD_LCDVCTL_LCDCPFSELX_MASK);

    return (DL_LCD_CHARGE_PUMP_FREQUENCY)(chargePumpFreq);
}

/**
 *  @brief Set internal reference voltage
 *         设置内部参考电压
 *
 *  @param[in] lcd          Pointer to the register overlay for the peripheral
 *                          外设寄存器基地址指针
 *  @param[in] vrefInternal The internal reference voltage to select.
 *                          One of @ref DL_LCD_VREF_INTERNAL
 *                          内部参考电压值
 *
 */
__STATIC_INLINE void DL_LCD_setVREFInternal(
    LCD_Regs *lcd, DL_LCD_VREF_INTERNAL vrefInternal)
{
    DL_Common_updateReg(&lcd->LCDVCTL, (uint32_t) vrefInternal,
        LCD_LCDVCTL_VLCDX_MASK);
}

/**
 *  @brief Get the internal reference voltage
 *         获取当前内部参考电压
 *
 *  @param[in]  lcd Pointer to the register overlay for the peripheral
 *                  外设寄存器基地址指针
 *
 *  @return     The current internal reference voltage
 *              当前内部参考电压
 *
 *  @retval     One of @ref DL_LCD_VREF_INTERNAL
 */
__STATIC_INLINE DL_LCD_VREF_INTERNAL DL_LCD_getVREFInternal(const LCD_Regs *lcd)
{
    uint32_t vrefInternal = (lcd->LCDVCTL & LCD_LCDVCTL_VLCDX_MASK);

    return (DL_LCD_VREF_INTERNAL)(vrefInternal);
}

/**
 * @brief Enables charge pump
 *        使能充电泵
 *
 * @param   lcd    Pointer to the register overlay for the peripheral
 *                 外设寄存器基地址指针
 *
 * @pre     VLCD must be generated internally (VLCDEXT = 0) and VLCD > 0 or
 *          VLCDREFx > 0 in order to use this configuration.
 *          VLCD 必须由内部产生（VLCDEXT = 0）且 VLCD > 0 或 VLCDREFx > 0
 */
__STATIC_INLINE void DL_LCD_enableChargePump(LCD_Regs *lcd)
{
    lcd->LCDVCTL |= LCD_LCDVCTL_LCDCPEN_CP_ENABLE;
}

/**
 * @brief Disables charge pump
 *        禁用充电泵
 *
 * @param lcd   Pointer to the register overlay for the peripheral
 *              外设寄存器基地址指针
 */
__STATIC_INLINE void DL_LCD_disableChargePump(LCD_Regs *lcd)
{
    lcd->LCDVCTL &= ~(LCD_LCDVCTL_LCDCPEN_MASK);
}

/**
 * @brief Enables internal reference voltage
 *        使能内部参考电压
 *
 * @param lcd   Pointer to the register overlay for the peripheral
 *              外设寄存器基地址指针
 *
 */
__STATIC_INLINE void DL_LCD_enableVREFInternal(LCD_Regs *lcd)
{
    lcd->LCDVCTL |= LCD_LCDVCTL_LCDREFEN_INT_REF_ENABLE;
}

/**
 * @brief Disables internal reference voltage
 *        禁用内部参考电压
 *
 * @param lcd   Pointer to the register overlay for the peripheral
 *              外设寄存器基地址指针
 */
__STATIC_INLINE void DL_LCD_disableVREFInternal(LCD_Regs *lcd)
{
    lcd->LCDVCTL &= ~(LCD_LCDVCTL_LCDREFEN_MASK);
}

/**
 *  @brief Set source for R33
 *         设置 R33 引脚供电来源
 *
 *  @param[in] lcd          Pointer to the register overlay for the peripheral
 *                          外设寄存器基地址指针
 *  @param[in] r33Source    The internal reference voltage to select.
 *                          One of @ref DL_LCD_R33_SOURCE
 *                          R33 供电来源
 *
 */
__STATIC_INLINE void DL_LCD_setR33source(
    LCD_Regs *lcd, DL_LCD_R33_SOURCE r33Source)
{
    DL_Common_updateReg(&lcd->LCDVCTL, (uint32_t) r33Source,
        LCD_LCDVCTL_LCDSELVDD_MASK);
}

/**
 *  @brief Get the source for R33
 *         获取 R33 引脚当前供电来源
 *
 *  @param[in]  lcd Pointer to the register overlay for the peripheral
 *                  外设寄存器基地址指针
 *
 *  @return     The current source for R33
 *              R33 当前供电来源
 *
 *  @retval     One of @ref DL_LCD_R33_SOURCE
 */
__STATIC_INLINE DL_LCD_R33_SOURCE DL_LCD_getR33Source(const LCD_Regs *lcd)
{
    uint32_t r33Source = (lcd->LCDVCTL & LCD_LCDVCTL_LCDSELVDD_MASK);

    return (DL_LCD_R33_SOURCE)(r33Source);
}

/**
 *  @brief Select internal bias power mode
 *         选择内部偏置功耗模式
 *
 *  @param[in]  lcd         Pointer to the register overlay for the peripheral
 *                          外设寄存器基地址指针
 *  @param[in]  powerMode   The power mode to use for generating bias voltage
 *                          for LCD. One of @ref DL_LCD_POWER_MODE
 *                          偏置电压生成功耗模式
 *
 *  @pre    The user must first enable the internal bias voltage resistor
 *          divider by calling @ref DL_LCD_enableInternalBias
 *          需先调用 @ref DL_LCD_enableInternalBias 使能内部分压电阻
 */
__STATIC_INLINE void DL_LCD_setInternalBiasPowerMode(
    LCD_Regs *lcd, DL_LCD_POWER_MODE powerMode)
{
    DL_Common_updateReg(&lcd->LCDVCTL, (uint32_t) powerMode,
        LCD_LCDVCTL_LCD_HP_LP_MASK);
}

/**
 *  @brief Get power mode
 *         获取当前功耗模式
 *
 *  @param[in]  lcd Pointer to the register overlay for the peripheral
 *                  外设寄存器基地址指针
 *
 *  @return     The power mode
 *              当前功耗模式
 *
 *  @retval     One of @ref DL_LCD_POWER_MODE
 */
__STATIC_INLINE DL_LCD_POWER_MODE DL_LCD_getPowerMode(const LCD_Regs *lcd)
{
    uint32_t powerMode = (lcd->LCDVCTL & LCD_LCDVCTL_LCDSELVDD_MASK);

    return (DL_LCD_POWER_MODE)(powerMode);
}

/**
 *  @brief Set bias voltage source
 *         设置偏置电压来源
 *
 *  @param[in]  lcd                 Pointer to the register overlay for the
 *                                  peripheral
 *                                  外设寄存器基地址指针
 *  @param[in]  biasVoltageSource   The bias voltage source.
 *                                  One of @ref DL_LCD_BIAS_VOLTAGE_SOURCE
 *                                  偏置电压来源
 *
 *  @pre        The user must first enable the internal bias voltage resistor
                divider by calling @ref DL_LCD_enableInternalBias
 *              需先调用 @ref DL_LCD_enableInternalBias 使能内部分压电阻
 */
__STATIC_INLINE void DL_LCD_setBiasVoltageSource(
    LCD_Regs *lcd, DL_LCD_BIAS_VOLTAGE_SOURCE biasVoltageSource)
{
    DL_Common_updateReg(&lcd->LCDVCTL, (uint32_t) biasVoltageSource,
        LCD_LCDVCTL_VLCDSEL_VDD_R33_MASK);
}

/**
 *  @brief Get bias voltage source
 *         获取当前偏置电压来源
 *
 *  @param[in]  lcd Pointer to the register overlay for the peripheral
 *                  外设寄存器基地址指针
 *
 *  @return     The bias voltage source
 *              当前偏置电压来源
 *
 *  @retval     One of @ref DL_LCD_BIAS_VOLTAGE_SOURCE
 */
__STATIC_INLINE DL_LCD_BIAS_VOLTAGE_SOURCE DL_LCD_getBiasVoltageSource(
    const LCD_Regs *lcd)
{
    uint32_t biasVoltageSource = (
        lcd->LCDVCTL & LCD_LCDVCTL_VLCDSEL_VDD_R33_MASK);

