zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_lcd.h
    return (DL_LCD_BIAS_VOLTAGE_SOURCE)(biasVoltageSource);
}

/**
 * @brief Enables internal bias voltage resistor divider
 *        使能内部偏置电压分压电阻
 *
 * @param lcd   Pointer to the register overlay for the peripheral
 *              外设寄存器基地址指针
 *
 */
__STATIC_INLINE void DL_LCD_enableInternalBias(LCD_Regs *lcd)
{
    lcd->LCDVCTL |= LCD_LCDVCTL_LCDINTBIASEN_INT_BIAS_ENABLE;
}

/**
 * @brief Disables internal bias voltage resistor divider
 *        禁用内部偏置电压分压电阻
 *
 * @param lcd   Pointer to the register overlay for the peripheral
 *              外设寄存器基地址指针
 */
__STATIC_INLINE void DL_LCD_disableInternalBias(LCD_Regs *lcd)
{
    lcd->LCDVCTL &= ~(LCD_LCDVCTL_LCDINTBIASEN_MASK);
}

/**
 *  @brief Select LCD bias
 *         选择 LCD 偏置比
 *
 *  @param[in]  lcd     Pointer to the register overlay for the peripheral
 *                      外设寄存器基地址指针
 *  @param[in]  biasSel The bias. One of @ref DL_LCD_BIAS
 *                      偏置比
 *
 *  @note       This bit (LCDBIASSEL) is ignored in static mode and for 2-mux,
 *              3-mux, and 4-mux LCD modes
 *              静态模式及 2-mux/3-mux/4-mux 模式下此位无效
 */
__STATIC_INLINE void DL_LCD_setBias(
    LCD_Regs *lcd, DL_LCD_BIAS biasSel)
{
    DL_Common_updateReg(
        &lcd->LCDVCTL, (uint32_t) biasSel, LCD_LCDVCTL_LCDBIASSEL_MASK);
}

/**
 *  @brief Get bias for LCD
 *         获取当前 LCD 偏置比
 *
 *  @param[in]  lcd Pointer to the register overlay for the peripheral
 *                  外设寄存器基地址指针
 *
 *  @return     The bias for the LCD
 *              当前 LCD 偏置比
 *
 *  @retval     One of @ref DL_LCD_BIAS
 */
__STATIC_INLINE DL_LCD_BIAS DL_LCD_getBias(const LCD_Regs *lcd)
{
    uint32_t biasSel = (lcd->LCDVCTL & LCD_LCDVCTL_LCDBIASSEL_MASK);

    return (DL_LCD_BIAS)(biasSel);
}

/**
 *  @brief Set reference mode for R13 voltage
 *         设置 R13 电压参考模式
 *
 *  @param[in] lcd      Pointer to the register overlay for the peripheral
 *                      外设寄存器基地址指针
 *  @param[in] refMode  Ref mode. One of @ref DL_LCD_REFERENCE_MODE
 *                      参考模式
 *
 */
__STATIC_INLINE void DL_LCD_setRefMode(
    LCD_Regs *lcd, DL_LCD_REFERENCE_MODE refMode)
{
    DL_Common_updateReg(
        &lcd->LCDVCTL, (uint32_t) refMode, LCD_LCDVCTL_LCDREFMODE_MASK);
}

/**
 *  @brief Get reference mode for R13 voltage
 *         获取 R13 电压参考模式
 *
 *  @param[in]  lcd Pointer to the register overlay for the peripheral
 *                  外设寄存器基地址指针
 *
 *  @return     Voltage reference mode
 *              电压参考模式
 *
 *  @retval     One of @ref DL_LCD_REFERENCE_MODE
 */
__STATIC_INLINE DL_LCD_REFERENCE_MODE DL_LCD_getRefMode(const LCD_Regs *lcd)
{
    uint32_t refMode = (lcd->LCDVCTL & LCD_LCDVCTL_LCDREFMODE_MASK);

    return (DL_LCD_REFERENCE_MODE)(refMode);
}

/**
 *  @brief Write to bits in LCD memory index register
 *         写入 LCD 内存索引寄存器
 *
 *  @param[in]  lcd         Pointer to the register overlay for the peripheral
 *                          外设寄存器基地址指针
 *  @param[in]  memIndex    Index of LCDMx register to write to.
 *                          One of @ref DL_LCD_MEMORY.
 *                          LCDMx 寄存器索引
 *  @param[in]  mask        Registers to set in LCDMx register.
 *                          Bitwise OR of @ref DL_LCD_MEMORY_BIT.
 *                          要写入的位掩码
 */
__STATIC_INLINE void DL_LCD_writeMemory(
    LCD_Regs *lcd, DL_LCD_MEMORY memIndex, uint32_t mask)
{
    lcd -> LCDM[(uint32_t) memIndex] = mask;
}

/**
 *  @brief Set bits in LCD memory index register
 *         置位 LCD 内存索引寄存器中的指定位
 *
 *  @param[in]  lcd         Pointer to the register overlay for the peripheral
 *                          外设寄存器基地址指针
 *  @param[in]  memIndex    Index of LCDMx register to write to.
 *                          One of @ref DL_LCD_MEMORY.
 *                          LCDMx 寄存器索引
 *  @param[in]  mask        Registers to set in LCDMx register.
 *                          Bitwise OR of @ref DL_LCD_MEMORY_BIT.
 *                          要置位的位掩码
 */
__STATIC_INLINE void DL_LCD_setMemory(
    LCD_Regs *lcd, DL_LCD_MEMORY memIndex, uint32_t mask)
{
    lcd -> LCDM[(uint32_t) memIndex] |= mask;
}

/**
 *  @brief Toggle bits in LCD memory index register
 *         翻转 LCD 内存索引寄存器中的指定位
 *
 *  @param[in]  lcd         Pointer to the register overlay for the peripheral
 *                          外设寄存器基地址指针
 *  @param[in]  memIndex    Index of LCDMx register to write to.
 *                          One of @ref DL_LCD_MEMORY.
 *                          LCDMx 寄存器索引
 *  @param[in]  mask        Registers to set in LCDMx register.
 *                          Bitwise OR of @ref DL_LCD_MEMORY_BIT.
 *                          要翻转的位掩码
 */
__STATIC_INLINE void DL_LCD_toggleMemory(
    LCD_Regs *lcd, DL_LCD_MEMORY memIndex, uint32_t mask)
{
    lcd -> LCDM[(uint32_t) memIndex] ^= mask;
}

/**
 *  @brief Clear bits in LCD memory index register
 *         清除 LCD 内存索引寄存器中的指定位
 *
 *  @param[in]  lcd         Pointer to the register overlay for the peripheral
 *                          外设寄存器基地址指针
 *  @param[in]  memIndex    Index of LCDMx register to write to.
 *                          One of @ref DL_LCD_MEMORY.
 *                          LCDMx 寄存器索引
 *  @param[in]  mask        Registers to set in LCDMx register.
 *                          Bitwise OR of @ref DL_LCD_MEMORY_BIT.
 *                          要清除的位掩码
 */
__STATIC_INLINE void DL_LCD_clearMemory(
    LCD_Regs *lcd, DL_LCD_MEMORY memIndex, uint32_t mask)
{
    lcd -> LCDM[(uint32_t) memIndex] &= ~(mask);
}

/**
 *  @brief Get bits in LCD memory index register
 *         读取 LCD 内存索引寄存器
 *
 *  @param[in]  lcd         Pointer to the register overlay for the peripheral
 *                          外设寄存器基地址指针
 *  @param[in]  memIndex    Index of LCDMx register to read from.
 *                          LCDMx 寄存器索引
 *
 *  @retval     32 bit value of register
 *              寄存器 32 位值
 *
 *  @sa         DL_LCD_MEMORY_BIT
 */
__STATIC_INLINE uint32_t DL_LCD_getMemory(
    const LCD_Regs *lcd, DL_LCD_MEMORY memIndex)
{
    return lcd -> LCDM[(uint32_t) memIndex];
}

/**
 *  @brief Write to bits in LCD blinking memory index register
 *         写入 LCD 闪烁内存索引寄存器
 *
 *  @param[in]  lcd         Pointer to the register overlay for the peripheral
 *                          外设寄存器基地址指针
 *  @param[in]  memIndex    Index of LCDMx register to write to.
 *                          One of @ref DL_LCD_BLINKING_MEMORY.
 *                          LCDBMx 寄存器索引
 *  @param[in]  mask        Registers to set in LCDBMx register.
 *                          Bitwise OR of @ref DL_LCD_BLINK_MEMORY_BIT.
 *                          要写入的位掩码
 */
__STATIC_INLINE void DL_LCD_writeBlinkingMemory(
    LCD_Regs *lcd, DL_LCD_BLINKING_MEMORY memIndex, uint32_t mask)
{
    lcd -> LCDBM[(uint32_t) memIndex] = mask;
}

/**
 *  @brief Set bits in LCD blinking memory index register
 *         置位 LCD 闪烁内存索引寄存器中的指定位
 *
 *  @param[in]  lcd         Pointer to the register overlay for the peripheral
 *                          外设寄存器基地址指针
 *  @param[in]  memIndex    Index of LCDMx register to write to.
 *                          One of @ref DL_LCD_BLINKING_MEMORY.
 *                          LCDBMx 寄存器索引
 *  @param[in]  mask        Registers to set in LCDBMx register.
 *                          Bitwise OR of @ref DL_LCD_BLINK_MEMORY_BIT.
 *                          要置位的位掩码
 */
__STATIC_INLINE void DL_LCD_setBlinkingMemory(
    LCD_Regs *lcd, DL_LCD_BLINKING_MEMORY memIndex, uint32_t mask)
{
    lcd -> LCDBM[(uint32_t) memIndex] |= mask;
}

/**
 *  @brief Toggle bits in LCD blinking memory index register
 *         翻转 LCD 闪烁内存索引寄存器中的指定位
 *
 *  @param[in]  lcd         Pointer to the register overlay for the peripheral
 *                          外设寄存器基地址指针
 *  @param[in]  memIndex    Index of LCDMx register to write to.
 *                          One of @ref DL_LCD_BLINKING_MEMORY.
 *                          LCDBMx 寄存器索引
 *  @param[in]  mask        Registers to set in LCDBMx register.
 *                          Bitwise OR of @ref DL_LCD_BLINK_MEMORY_BIT.
 *                          要翻转的位掩码
 */
__STATIC_INLINE void DL_LCD_toggleBlinkingMemory(
    LCD_Regs *lcd, DL_LCD_BLINKING_MEMORY memIndex, uint32_t mask)
{
    lcd -> LCDBM[(uint32_t) memIndex] ^= mask;
}

/**
 *  @brief Clear bits in LCD blinking memory index register
 *         清除 LCD 闪烁内存索引寄存器中的指定位
 *
 *  @param[in]  lcd         Pointer to the register overlay for the peripheral
 *                          外设寄存器基地址指针
 *  @param[in]  memIndex    Index of LCDMx register to write to.
 *                          One of @ref DL_LCD_BLINKING_MEMORY.
 *                          LCDBMx 寄存器索引
 *  @param[in]  mask        Registers to set in LCDBMx register.
 *                          Bitwise OR of @ref DL_LCD_BLINK_MEMORY_BIT.
 *                          要清除的位掩码
 */
__STATIC_INLINE void DL_LCD_clearBlinkingMemory(
    LCD_Regs *lcd, DL_LCD_BLINKING_MEMORY memIndex, uint32_t mask)
{
    lcd -> LCDBM[(uint32_t) memIndex] &= ~(mask);
}

/**
 *  @brief Get bits in LCD blinking memory index register
 *         读取 LCD 闪烁内存索引寄存器
 *
 *  @param[in]  lcd         Pointer to the register overlay for the peripheral
 *                          外设寄存器基地址指针
 *  @param[in]  memIndex    Index of LCDMx register to read from.
 *                          LCDBMx 寄存器索引
 *
 *  @retval     32 bit value of register
 *              寄存器 32 位值
 *
 *  @sa         DL_LCD_BLINK_MEMORY_BIT
 */
__STATIC_INLINE uint32_t DL_LCD_getBlinkingMemory(
    const LCD_Regs *lcd, DL_LCD_BLINKING_MEMORY memIndex)
{
    return lcd -> LCDBM[(uint32_t) memIndex];
}

/**
 *  @brief Set number of cycles to enable voltage generation circuitry
 *         设置电压生成电路使能时钟周期数
 *
 *  @param[in] lcd      Pointer to the register overlay for the peripheral
 *                      外设寄存器基地址指针
 *  @param[in] cycles   The number of cycles to enable voltage generation circuitry.
 *                      One of @ref DL_LCD_VREFGEN_CYCLES.
 *                      使能时钟周期数
 */
__STATIC_INLINE void DL_LCD_setVrefOnTimeCycles(
    LCD_Regs *lcd, DL_LCD_VREFGEN_CYCLES cycles)
{
    DL_Common_updateReg(&lcd->LCDVREFCFG, (uint32_t) cycles,
        LCD_LCDVREFCFG_ONTIME_MASK);
}

/**
 *  @brief Get the number of cycles set to enable voltage generation circuitry
 *         获取电压生成电路使能时钟周期数
 *
 *  @param[in]  lcd  Pointer to the register overlay for the peripheral
 *                   外设寄存器基地址指针
 *
 *  @return     The number of cycles
 *              使能时钟周期数
 *
 *  @retval     One of @ref DL_LCD_VREFGEN_CYCLES
 */
__STATIC_INLINE DL_LCD_VREFGEN_CYCLES DL_LCD_getVrefOnTimeCycles(const LCD_Regs *lcd)
{
    uint32_t cycles = (lcd->LCDVREFCFG & LCD_LCDVREFCFG_ONTIME_MASK);

    return (DL_LCD_VREFGEN_CYCLES)(cycles);
}

#ifdef __cplusplus
}
#endif

#endif /* __MSPM0_HAS_LCD__ */

#endif /* ti_dl_dl_lcd__include */
/** @}*/
